{"columns":["customer_id","customer_name","user_message","sub_intent","ground_truth"],"data":[["C012","Lars Svensson","What's the status of my request to enable international usage from last week?","SERVICE REQUEST DETAILS","Your request to enable international usage for your MC card ending with 3333 is currently active. Please allow up to 2–4 business days for the change to be fully processed. You will receive a confirmation on your registered phone number once the update is complete."],["C012","Lars Svensson","How do BankX cards compare to others?","OUT OF CONTEXT","For information about how BankX cards compare to those from other banks, please visit our official bank portal at www.demo@BankX.com. I can assist you with details about your own credit cards or related services if needed."],["C001","Alice Johnson","Tell me my balance.","CARD BALANCE","You have three cards. For your VISA card ending with 6467, the current balance is $500.00. For your MASTERCARD ending with 5662, the balance is $0.00. For your VISA card ending with 2468, the balance is $50.00. If you need details for a specific card, please let me know."],["C001","Alice Johnson","My active card isn't blocked yet.","CARD BLOCKING","Your VISA card ending with 6467 is currently active and not blocked. If you wish to block this card, please confirm the reason for blocking, such as loss, theft, or unauthorized activity, so I can proceed with your request."],["C001","Alice Johnson","Activate card ************0171.","CARD ACTIVATION","I couldn't find any credit card ending with 0171 linked to your profile. If you don't have any cards yet, please visit our bank portal at www.demo@BankX.com to apply for one."],["C001","Alice Johnson","Check my account activity.","OUT OF CONTEXT","You have three credit cards. Your VISA card ending in 6467 is currently active with a current balance of $500.00 and an annual fee of $99.99. International usage is enabled on this card. There is an active service request to block this card. Your MASTERCARD ending in 5662 is blocked with a current balance of $0.00 and no annual fee. International usage is disabled on this card. Your VISA card ending in 2468 is also blocked with a current balance of $50.00 and an annual fee of $49.99. International usage is enabled on this card."],["C001","Alice Johnson","Where can I find card benefits?","CARD DETAILS","You can find information about card benefits by visiting the official BankX portal at www.demo@BankX.com. Please let me know if you have any questions about your existing credit cards."],["C008","Henry Adams","Annual fee for my VISA.","ANNUAL FEES","You have two VISA cards on file. One ends in 9010 and the other ends in 3333. Could you please specify which VISA card you are asking about?"],["C008","Henry Adams","Annual fee for the active VISA card.","ANNUAL FEES","You have two active VISA cards. One ending in 9010 and another ending in 3333. Could you please specify which card you are asking about?"],["C008","Henry Adams","Block the card because I lost it.","CARD BLOCKING","I understand you want to block your card because you lost it. To ensure I block the correct one, could you please tell me which card you are referring to? You have a VISA card ending in 9010, a MASTERCARD ending in 1098, and a VISA card ending in 3333."],["C008","Henry Adams","Confirm block.","CARD BLOCKING","You have requested to block a card, but I need to confirm which specific card you want to block. You currently have three cards: a VISA card ending with 9010 (currently active), a MASTERCARD ending with 1098 (already blocked), and another VISA ending with 3333 (active). Please confirm the last four digits of the card you wish to block, and let me know the reason for blocking so I can proceed immediately."],["C008","Henry Adams","Is the card I lost blocked now?","CARD BLOCKING","Yes, one of your cards, the MASTERCARD ending in 1098, is currently blocked."],["C008","Henry Adams","Status of the card I lost.","SERVICE REQUEST DETAILS","Based on your account information, your Mastercard ending in 1098 is currently blocked."],["C008","Henry Adams","Is international usage enabled?","INTERNATIONAL USAGE","You have three cards. For your VISA card ending with 9010, international usage is enabled. For your MASTERCARD ending with 1098 and your VISA ending with 3333, international usage is currently disabled. If you want to enable or disable international usage for any specific card, please let me know which card you'd like to update."],["C001","Alice Johnson","How much is the annual fee for my primary card?","ANNUAL FEES","The annual fee for your primary VISA card ending with 6467 is $99.99."],["C001","Alice Johnson","Has my VISA card been blocked yet? I asked two days ago.","SERVICE REQUEST DETAILS","I see you have a request to block your VISA card ending in 6467. Currently, this card is still showing as ACTIVE. Your request is being processed, and we are escalating it to ensure it is resolved promptly. Please allow 2 to 4 business days for the status to update. You will receive a confirmation on your registered mobile number once the card is blocked. For further details, you can visit the bank portal at www.demo@BankX.com."],["C001","Alice Johnson","What is the status of my block request?","SERVICE REQUEST DETAILS","Your block request for the VISA card ending with 6467 is currently pending. Please allow 2–4 business days for resolution. You will receive a confirmation on your registered mobile number."],["C001","Alice Johnson","Is international usage active?","INTERNATIONAL USAGE","You have three cards. For your VISA card ending with 6467, international usage is currently active. For your MASTERCARD ending with 5662, international usage is not enabled. For your VISA card ending with 2468, international usage is also active. If you need to enable or disable international usage for any specific card, please let me know which one you'd like to update."],["C001","Alice Johnson","I need help with a charge on my card.","OUT OF CONTEXT","Transferring your request to a customer service agent for support with transaction details."],["C001","Alice Johnson","Where can I learn about rewards?","OUT OF CONTEXT","For information about credit card rewards, please visit the official BankX portal at www.demo@BankX.com. I can assist you with details regarding your existing credit cards if needed."],["C001","Alice Johnson","Show me card details.","CARD DETAILS","You have three credit cards linked to your account: a VISA card ending with 6467, a MASTERCARD ending with 5662, and another VISA card ending with 2468. Please let me know which specific card details you would like to know more about, such as balance, annual fee, or usage limit."],["C001","Alice Johnson","Can you confirm my block request?","SERVICE REQUEST DETAILS","You have a pending block request for your VISA card ending with 6467, citing unauthorized charges. The request status is currently pending. Once the request is processed and your card is blocked, you will receive a confirmation on your registered phone number. Please allow 2–4 business days for resolution. For further updates, you can also visit the bank portal at www.demo@BankX.com."],["C001","Alice Johnson","Fee for blocked MasterCard.","CARD BLOCKING","Your MasterCard ending with 5662 is currently blocked, and there is no annual fee charged for this card at the moment—the annual fee is $0.00."],["C001","Alice Johnson","Activate the 1234 card.","CARD ACTIVATION","It appears you want to activate the card ending with 1234. However, none of your cards have a number ending in 1234. Could you please confirm the correct card number or the last four digits?"],["C001","Alice Johnson","Need help with billing.","OUT OF CONTEXT","You have three credit cards on your account. Could you please specify which card you need billing information for? Let me know the last four digits or the type of card, and I can provide you with the balance or annual fee details."],["C001","Alice Johnson","hello","OUT OF CONTEXT","Hello Alice Johnson! How can I assist you with your credit card today?"],["C008","Henry Adams","Annual charge for my active VISA.","ANNUAL FEES","For your active VISA card ending with 9010, the annual fee is $60.00. If you are referring to your other active VISA card ending with 3333, there is no annual fee for that card."],["C008","Henry Adams","Can I get a new card?","SERVICE REQUEST DETAILS","You can apply for a new card by visiting our bank portal at www.demo@BankX.com."],["C008","Henry Adams","Fee for the second card.","ANNUAL FEES","The annual fee for your second card, the Mastercard ending in 1098, is $0.00."],["C008","Henry Adams","Activate card 5432.","CARD ACTIVATION","I couldn't find a card ending in 5432 associated with your account. Could you please double-check the card number and provide the correct one?"],["C008","Henry Adams","Are there different card types?","CARD DETAILS","You currently have different types of credit cards with us. Specifically, you have VISA and MASTERCARD cards linked to your account."],["C011","Keiko Tanaka","Is international usage possible?","INTERNATIONAL USAGE","Yes, international usage is currently enabled on your VISA card ending with 3333. You can use this card for international transactions without any issues."],["C011","Keiko Tanaka","I requested a limit increase, status?","SERVICE REQUEST DETAILS","I see you have an active service request to update the limit on your card ending in 3333. The request status is currently active."],["C001","Alice Johnson","What's the limit on my primary card?","CARD DETAILS","You have three credit cards linked to your account. A VISA card ending in 6467, a MASTERCARD ending in 5662, and a VISA card ending in 2468. Could you please specify which of these you consider your primary card so I can provide the limit?"],["C001","Alice Johnson","Can I activate a card?","CARD ACTIVATION","You have multiple cards on your account. Could you please specify which card you would like to activate? I see you have a VISA card ending with 6467, a MASTERCARD ending with 5662, and another VISA ending with 2468. Let me know which one you'd like to activate, and I'll check its status for you."],["C001","Alice Johnson","I need to see my recent transactions.","CARD DETAILS","Transferring your request to a customer service agent for support with transaction details."],["C001","Alice Johnson","Tell me about card benefits.","OUT OF CONTEXT","I'm unable to assist with this request. Please visit the official bank portal at www.demo@BankX.com for information regarding card benefits."],["C008","Henry Adams","Annual fee for the card I reported lost?","ANNUAL FEES","Could you please confirm which specific card you reported as lost? Once you provide the last four digits or any other identifying detail, I can share the annual fee for that card."],["C008","Henry Adams","I lost my card, I need to block it.","CARD BLOCKING","You have three cards: a VISA ending with 9010, a MASTERCARD ending with 1098, and another VISA ending with 3333. Could you please confirm which card you lost so I can proceed to block the correct one for you?"],["C008","Henry Adams","About 6 hours ago, I asked to block my card. Is it done?","SERVICE REQUEST DETAILS","Your request to block your card ending with 9010 is still pending and has not been completed yet. It may take a little more time to process. Please allow up to 2–4 business days for resolution, and you will receive a confirmation on your registered phone number."],["C008","Henry Adams","Details about my second card.","CARD DETAILS","Your second card is a MASTERCARD with card number ending in 1098. Its current status is BLOCKED. International usage is currently disabled, the usage limit is $0, the current balance is $0, and there is no annual fee for this card."],["C008","Henry Adams","Can I change my billing address?","OUT OF CONTEXT","I’m unable to assist with changing your billing address. For any updates to your account or personal information, please visit the official bank portal at www.demo@BankX.com."],["C011","Keiko Tanaka","Is international usage enabled?","INTERNATIONAL USAGE","Yes, international usage is currently enabled on your VISA card ending with 3333."],["C011","Keiko Tanaka","Activate my card.","CARD ACTIVATION","Your VISA card ending with 3333 is already active, so no further activation is needed. If you meant a different card, please provide the last four digits so I can assist you."],["C011","Keiko Tanaka","Status of my recent request?","SERVICE REQUEST DETAILS","Your most recent service request is to update the usage limit to $8,000 for business travel on your VISA card ending with 3333. The status of this request is currently ACTIVE."],["C012","Lars Svensson","Details on my MasterCard.","CARD DETAILS","Your MasterCard ending with 3333 is currently active. The international usage feature is not enabled. The card has a $0 current balance and does not have any annual fee set at this time."],["C012","Lars Svensson","cheers","OUT OF CONTEXT","I'm unable to assist with this request. Please feel free to ask about your credit cards, and I'll be happy to help!"],["C001","Alice Johnson","Amount owed on my primary card?","CARD BALANCE","You have a few credit cards with us. There is a VISA card ending in 6467, a MASTERCARD ending in 5662, and another VISA card ending in 2468. Could you please tell me which one you consider your primary card so I can provide the balance?"],["C001","Alice Johnson","Annual fee on card ending 0171?","ANNUAL FEES","The annual fee for your VISA card ending in 6467 is $99.99."],["C001","Alice Johnson","Details for my first card.","CARD DETAILS","You have three credit cards linked to your account. A VISA card ending in 6467, a MASTERCARD ending in 5662, and a VISA card ending in 2468. Which specific details would you like to know about your first card, the VISA card ending in 6467?"],["C001","Alice Johnson","Block card ************0171.","CARD BLOCKING","Can you please confirm the reason you want to block your VISA card ending with 0171? Once you confirm, I will proceed to block the card for you, and you will receive a confirmation on your registered phone number."],["C001","Alice Johnson","Did my block request go through?","SERVICE REQUEST DETAILS","Your block request for the VISA card ending with 6467 is still pending. Please allow 2–4 business days for completion. You will receive a confirmation on your registered phone number."],["C001","Alice Johnson","Status of the blocking service request.","SERVICE REQUEST DETAILS","I see a service request to block your card ending in 6467. The status of this request is currently active."],["C001","Alice Johnson","Limit on card ************5678.","CARD DETAILS","The usage limit for your card ending with 5678 was not found. Please double-check the card number or specify the card you would like the limit details for, as none of your cards have a number ending in 5678. Your current cards are a VISA ending with 6467, a MASTERCARD ending with 5662, and another VISA ending with 2468."],["C001","Alice Johnson","How to activate a blocked card?","CARD ACTIVATION","To activate a blocked card, please confirm which card you would like to activate. You currently have two blocked cards: your MASTERCARD ending with 5662 and your VISA card ending with 2468. Once you confirm the specific card, I will proceed with the activation process."],["C011","Keiko Tanaka","Can I activate my card?","CARD ACTIVATION","You currently have a VISA credit card ending with 3333 and it is already active, so there is no need to activate it. If you need any other assistance regarding this card, please let me know."],["C011","Keiko Tanaka","View my transaction history.","CARD DETAILS","I'm unable to assist with this request. Please feel free to ask about your credit cards, and I'll be happy to help!"],["C011","Keiko Tanaka","Good morning.","OUT OF CONTEXT","Good morning, Keiko Tanaka. You currently have a VISA credit card ending with 3333. Please let me know what specific information or assistance you need regarding this card."],["C011","Keiko Tanaka","Limit update request status?","SERVICE REQUEST DETAILS","You have a pending request to update the usage limit on your VISA card ending with 3333 to $8,000 for business travel. The status of this request is still pending. Please allow 2–4 business days for resolution, and you will receive confirmation on your registered mobile number."],["C011","Keiko Tanaka","Is international use available?","INTERNATIONAL USAGE","Yes, international usage is currently enabled on your VISA card ending with 3333. You can use your card for international transactions without any issues."],["C011","Keiko Tanaka","Status of my limit increase request?","SERVICE REQUEST DETAILS","Your usage limit increase request for your VISA card ending with 3333 is currently pending. Please allow 2–4 business days for the request to be processed. You will receive a confirmation on your registered phone number."],["C011","Keiko Tanaka","How do I activate my card?","CARD ACTIVATION","You have a VISA credit card ending with 3333 that is currently active. If you are referring to this card, there is no need to activate it again as it is already active and ready for use. If you have any other card in mind, please provide the last four digits."],["C011","Keiko Tanaka","Last transactions on my card?","CARD DETAILS","Transferring your request to a customer service agent for support with transaction details."],["C011","Keiko Tanaka","Compare cards?","CARD DETAILS","For comparing different cards or exploring card options, please visit the official BankX portal at www.demo@BankX.com. If you need details about your existing VISA card ending with 3333, let me know what specific information you would like to compare."],["C012","Lars Svensson","Tell me about my card.","CARD DETAILS","You have one credit card linked to your account. It is a MC card ending in 3333. Its current status is ACTIVE. The current balance is $0.00, the annual fee is $0.00, and the usage limit is $0. International usage is currently disabled."],["C012","Lars Svensson","Status of my international usage request?","SERVICE REQUEST DETAILS","Your request to enable international usage for your MC card ending with 3333 is currently active and being processed. You will receive a confirmation on your registered phone number once the status is updated. Please allow 2–4 business days for resolution."],["C008","Henry Adams","Show me my account statement.","OUT OF CONTEXT","I'm unable to assist with account statements. Please visit the official bank portal at www.demo@BankX.com for your account statement or any related details."],["C011","Keiko Tanaka","I need to change my phone number.","OUT OF CONTEXT","I'm unable to assist with updating your phone number here. Please visit the official bank portal at www.demo@BankX.com to make changes to your contact information."]]}