{"columns":["original_index","user_message","ground_truth","style_type","source_message"],"data":[["122","I NEED INFO ON YOUR MORTGAGE PRODUCTS ASAP! PLEASE RESPOND IMMEDIATELY!","APPLY FOR MORTGAGE","urgent","Tell me about your mortgage products."],["529","How to close account?","CLOSE ACCOUNT","short","Procedure for account closure."],["432","Sorry to bother you, but would you mind showing me my loan payment schedule when you get a chance? Thank you so much!","CHECK LOAN PAYMENTS","polite","Show me my loan payment schedule."],["406","NEED TO KNOW WIRE TRANSFER FEES ASAP! PLEASE RESPOND IMMEDIATELY!","CHECK FEES","urgent","Fees for wire transfers."],["243","Hey, can you just go ahead and drop my mortgage pre-approval request?","CANCEL MORTGAGE","informal","Cancel the mortgage pre-approval request."],["968","Hey, I wanna set up my password.","SET UP PASSWORD","informal","I need to set a password."],["193","Could you please provide me with the procedure to cancel a loan application?","CANCEL LOAN","formal","Procedure for canceling a loan application."],["838","Hey, do you know what the capital of France is?","OUT OF CONTEXT","informal","Can you tell me the capital of France?"],["345","I NEED TO KNOW MY CARD’S YEARLY FEES RIGHT NOW! PLEASE RESPOND ASAP!","CHECK CARD ANNUAL FEE","urgent","What is the fee structure for my card yearly?"],["956","I am interested in applying for a loan and would appreciate any information or assistance you can provide regarding the process. Thank you very much for your help.","APPLY FOR LOAN","verbose","I need to apply for a loan."],["798","I would appreciate it if you could kindly process a transfer for me. Please let me know if you require any additional information. Thank you very much for your assistance.","MAKE TRANSFER","verbose","Execute a transfer."],["905","Sorry to bother you, but could you kindly let me know how I might set a password for my account? Thank you so much.","SET UP PASSWORD","polite","How to set a password for my account."],["539","Account closure time?","CLOSE ACCOUNT","short","How long does it take to close an account?"],["694","I forget my banking password. Please you help me reset?","GET PASSWORD","grammar_errors","Assistance with forgotten banking password."],["448","Sorry to bother you, but could you kindly let me know when my loan payment is due? Thank you very much for your help.","CHECK LOAN PAYMENTS","polite","When is my loan payment due date?"],["808","Hey, what's up with the future?","OUT OF CONTEXT","informal","Tell me about the future."],["15","I would appreciate it if you could let me know the total number of cards that are presently active on my account, as I want to keep track of all active cards for security reasons. Thank you very much.","ACTIVATE CARD","verbose","How many cards are currently active on my account?"],["370","Card limit used now?","CHECK CURRENT BALANCE ON CARD","short","What's the current limit used on my credit card?"],["737","URGENT! I NEED TO TALK TO A HUMAN RIGHT NOW! PLEASE TRANSFER ME IMMEDIATELY!","HUMAN AGENT","urgent","Transfer to human."],["303","Hey, can you tell me what my debit card can do?","CARD DETAILS","informal","Tell me about my debit card features."],["872","I would like to report that my bank card was retained by the ATM and was not returned to me.","RECOVER SWALLOWED CARD","formal","My card didn't come back from the ATM."],["490","Could you please provide a breakdown of the portion of my payment that is applied toward the principal amount?","CHECK MORTGAGE PAYMENTS","formal","How much of my payment goes towards principal?"],["814","Info on dinosaurs?","OUT OF CONTEXT","short","Tell me about dinosaurs."],["195","Please I want cancel my small business loan apply.","CANCEL LOAN","grammar_errors","Cancel my small business loan application."],["149","URGENT! My card has suspicious activity—BLOCK IT NOW PLEASE!","BLOCK CARD","urgent","I found suspicious activity, block my card."],["66","Activate my card for international use.","ACTIVATE CARD INTERNATIONAL USAGE","short","I plan to travel internationally soon, can you prepare my card?"],["57","I attempted to use my card while traveling internationally, but it was declined. May I inquire if international usage needs to be activated beforehand?","ACTIVATE CARD INTERNATIONAL USAGE","formal","My card was declined abroad, do I need to activate international usage?"],["383","Sorry to bother you, but if it’s not too much trouble, could you let me know how much is left on my card, please?","CHECK CURRENT BALANCE ON CARD","polite","How much funds are left on my card?"],["352","Hey, can you tell me how much is left on my card?","CHECK CURRENT BALANCE ON CARD","informal","Provide my card balance details."],["263","HELP! Need to CANCEL a transfer ASAP before it goes through!! What do I do right now?!","CANCEL TRANSFER","urgent","How do I cancel a transfer that hasn't gone through?"],["178","Hello, I recently received approval for my loan, but due to unforeseen circumstances, I am considering canceling it. Could you please advise me on the process and whether this is possible? Thank you for your assistance.","CANCEL LOAN","verbose","Can I cancel my approved loan?"],["97","Please tell me how I can make loan apply best way. I not sure steps.","APPLY FOR LOAN","grammar_errors","What's the best way to apply for a loan?"],["713","Excuse me, I just wanted to clarify whether I am speaking with an actual person or if you are a robot. Thank you for helping me understand!","GREETINGS","verbose","Are you a robot?"],["542","Hey, can you shut down my account number [account number]?","CLOSE ACCOUNT","informal","Please close account number [account number]."],["400","Sorry to trouble you, but could you please let me know if there are any fees on my account? Thank you so much for your help.","CHECK FEES","polite","What fees do I have on my account?"],["629","Could you please assist me in locating an ATM that is currently operational?","FIND ATM","formal","Locate an ATM that is open now."],["920","Hello, I will be traveling soon and would greatly appreciate it if you could ensure my debit card is ready and activated for use during my trip. Thank you so much for your assistance.","ACTIVATE CARD","verbose","Get my debit card ready for my trip."],["215","Hey, I found another place, so can you just cancel my mortgage app?","CANCEL MORTGAGE","informal","I found a different property, cancel this mortgage application."],["466","I would appreciate it if you could provide comprehensive information regarding my bi-weekly mortgage payments.","CHECK MORTGAGE PAYMENTS","formal","Provide details about my bi-weekly mortgage payments."],["599","I would greatly appreciate it if you could provide information about the nearest ATM located around [Street Name], as I need to withdraw some cash. Thank you for your assistance.","FIND ATM","verbose","Locate an ATM near [Street Name]."],["369","Hey, can ya tell me what my credit card limit and balance are right now?","CHECK CURRENT BALANCE ON CARD","informal","Inquire about my credit card limit and balance."],["793","Hey, I wanna send some cash overseas.","MAKE TRANSFER","informal","I need to send money internationally."],["167","Please cease all transactions and activities associated with my card immediately.","BLOCK CARD","formal","Stop all activity on my card."],["397","Hi, I'm so sorry to bother you, but if it's not too much trouble, could you please let me know what the fees are for paper statements? Thank you so much.","CHECK FEES","polite","What are the fees for paper statements?"],["390","Hello, I am planning to make an international transfer soon and would appreciate it if you could explain all applicable fees in detail. Thank you very much for your assistance.","CHECK FEES","verbose","Fees for international transfers."],["408","Sorry to trouble you, but could you kindly let me know what the charges are for getting a new card if mine is lost? Thank you very much for your help.","CHECK FEES","polite","What are the fees for replacing a lost card?"],["837","PLEASE! I need to know how tall Mount Everest is RIGHT NOW!","OUT OF CONTEXT","urgent","How tall is Mount Everest?"],["186","Cancel business loan app.","CANCEL LOAN","short","Cancel my small business loan application."],["374","Hello, I hope you can assist me. I would like to know the current balance on my card, as I need to keep track of my spending. Thank you very much for your help.","CHECK CURRENT BALANCE ON CARD","verbose","Card balance check."],["468","I NEED TO KNOW MY LAST MORTGAGE PAYMENT AMOUNT RIGHT NOW! THIS IS URGENT!","CHECK MORTGAGE PAYMENTS","urgent","Verify my last mortgage payment amount."],["636","I NEED A BANK BRANCH ASAP! WHERE’S THE CLOSEST ONE? URGENT!","FIND BRANCH","urgent","Bank branch near me."],["613","Sorry to bother you, but would you mind letting me know if there are any ATMs in [Area/Zip Code]? Thank you so much for your assistance.","FIND ATM","polite","Are there any ATMs in [Area/Zip Code]?"],["160","Block Visa card now.","BLOCK CARD","short","Block my Visa card."],["712","Hey bot, what's up?","GREETINGS","informal","Hi bot"],["836","Sorry to bother you, but would you mind telling me what 2 plus 2 is, if you have a moment?","OUT OF CONTEXT","polite","Calculate 2 plus 2."],["19","Um, sorry to bother you, but could you maybe activate my new card if it’s not too much trouble? Thank you so much!","ACTIVATE CARD","polite","I have a new card, activate it for me."],["151","Excuse me, if it’s not too much trouble, could you please block my supplementary card? Sorry for the inconvenience.","BLOCK CARD","polite","Block my supplementary card."],["595","Open account, please.","CREATE ACCOUNT","short","Request to open a bank account."],["544","Hi, sorry to bother you, but if it's not too much trouble, could you please help me with closing my account? Thank you so much for your help.","CLOSE ACCOUNT","polite","I want to shut down my account."],["296","Please what is card verification value? I not sure where to find CVV.","CARD DETAILS","grammar_errors","What is the card verification value (CVV)?"],["439","Hey, can you tell me how many payments I still gotta make on my loan?","CHECK LOAN PAYMENTS","informal","How many loan payments do I have left?"],["191","URGENT! Please STOP my loan application process right now! It can’t go through!","CANCEL LOAN","urgent","Stop the process for my loan application."],["69","Hey, can you take off the limits on my card for using it abroad?","ACTIVATE CARD INTERNATIONAL USAGE","informal","Please lift international restrictions on my card."],["175","Hello, I was wondering if there's an option available to block specific types of transactions on my card? I want to ensure some transactions don’t go through for security reasons. Thank you!","BLOCK CARD","verbose","Can I block a specific type of transaction on my card?"],["457","I would appreciate it if you could show me the full schedule for my mortgage payments, as I want to better plan my finances. Thank you very much for your assistance.","CHECK MORTGAGE PAYMENTS","verbose","Show me my mortgage payment schedule."],["72","Sorry to bother, but could you kindly guide me through the steps to apply for a consumer loan, if you don't mind?","APPLY FOR LOAN","polite","Guide me on how to apply for a consumer loan."],["205","URGENT! Please stop my loan application RIGHT NOW! It’s very important!","CANCEL LOAN","urgent","I want to stop my loan application."],["808","Could you please provide information regarding the future?","OUT OF CONTEXT","formal","Tell me about the future."],["671","Hey, how do I check what my current password is?","GET PASSWORD","informal","How can I see my current password?"],["498","Could you please provide a detailed list of the most recent transactions made using my card?","CHECK RECENT TRANSACTIONS","formal","What were the recent charges on my card?"],["354","I NEED MY VISA BALANCE RIGHT NOW! IT'S URGENT!","CHECK CURRENT BALANCE ON CARD","urgent","Check the balance for my Visa card."],["949","Where is branch close me? I want go now.","FIND BRANCH","grammar_errors","Locate a branch near me."],["933","Card stuck in ATM—what now?","RECOVER SWALLOWED CARD","short","What should I do if my card got stuck in the ATM?"],["613","Hey, you know if there’s any ATMs around here or in [Area/Zip Code]?","FIND ATM","informal","Are there any ATMs in [Area/Zip Code]?"],["35","I have recently received a new card via mail. Could you please advise me on the activation process?","ACTIVATE CARD","formal","I just received a new card in the mail, how do I activate it?"],["618","Excuse me, I’m so sorry to bother you, but could you possibly let me know where the nearest ATM is? Thank you so much.","FIND ATM","polite","Locate an ATM near me."],["663","Excuse me, I'm so sorry to bother you, but if it's not too much trouble, could you please tell me the address of the nearest branch? Thank you very much.","FIND BRANCH","polite","What's the address of the nearest branch?"],["533","What happen with money stay in account if I close it?","CLOSE ACCOUNT","grammar_errors","What happens to the remaining balance when I close an account?"],["154","I noticed some unusual activity on my account, so I kindly request that you block my credit card immediately to prevent any unauthorized transactions. Thank you very much for your prompt attention.","BLOCK CARD","verbose","Block my credit card immediately."],["654","Hello, I was wondering if you could kindly let me know whether your bank operates any branches inside [Shopping Mall Name]? Thank you for your assistance.","FIND BRANCH","verbose","Are there branches in [Shopping Mall Name]?"],["237","URGENT! Please CANCEL my mortgage application RIGHT NOW!","CANCEL MORTGAGE","urgent","Can I withdraw my mortgage application?"],["844","Excuse me, I'm so sorry to bother you, but could you possibly assist me with recovering my card? The ATM has swallowed it. Thank you very much for your help.","RECOVER SWALLOWED CARD","polite","The ATM swallowed my card."],["204","Hey, can you just drop my business loan app? Don't need it anymore.","CANCEL LOAN","informal","Cancel my business loan application."],["294","Card status?","CARD DETAILS","short","Check the status of my card."],["246","I would like to kindly request the cancellation of my previously submitted transfer instruction, as I no longer need this transaction to be processed. Thank you for your assistance.","CANCEL TRANSFER","verbose","Cancel the transfer instruction."],["220","Hi, I’m so sorry to trouble you, but could you please help me cancel my refinance mortgage application? Thank you very much for your understanding.","CANCEL MORTGAGE","polite","Cancel my refinance mortgage application."],["626","Hey, where can I find an ATM nearby to drop some cash in?","FIND ATM","informal","Where is the nearest ATM for cash deposit?"],["622","I would greatly appreciate it if you could assist me by letting me know where I can find the closest ATM in my area. Thank you so much for your help.","FIND ATM","verbose","Show me the closest ATM."],["68","Hi, I am planning an international trip soon and would greatly appreciate it if you could set my card to be active for those specific travel dates. Thank you very much for your assistance.","ACTIVATE CARD INTERNATIONAL USAGE","verbose","Set international travel dates for my card."],["801","URGENT! Please SEND money NOW via bank transfer! ASAP!","MAKE TRANSFER","urgent","Send money via bank transfer."],["213","Please, I want cancel my mortgage that is approved. How I do this?","CANCEL MORTGAGE","grammar_errors","Can I cancel my approved mortgage?"],["74","Hey, what's the easiest way to get a loan?","APPLY FOR LOAN","informal","What's the best way to apply for a loan?"],["824","You can telling me story now?","OUT OF CONTEXT","grammar_errors","Tell me a story."],["327","URGENT! Do I HAVE TO pay the annual fee THIS YEAR? Please tell me ASAP!","CHECK CARD ANNUAL FEE","urgent","Do I need to pay an annual fee this year?"],["564","Hey, what do I need to open up an account with you guys?","CREATE ACCOUNT","informal","What are the requirements for opening an account?"],["150","Please, my card number last 4 digit is [last 4 digits] is compromise. You block it?","BLOCK CARD","grammar_errors","My card number [last 4 digits] is compromised, block it."],["368","I NEED MY CARD STATEMENT BALANCE RIGHT NOW! PLEASE HELP ASAP!","CHECK CURRENT BALANCE ON CARD","urgent","Can you tell me my card statement balance?"],["212","I kindly request that you please cancel my construction mortgage application. I have reconsidered my options and will not be proceeding at this time. Thank you very much for your assistance.","CANCEL MORTGAGE","verbose","Cancel my construction mortgage application."],["143","Hey, I lost my debit card, can you block it for me?","BLOCK CARD","informal","I lost my debit card, can you block it?"],["710","Can you start the chat now? I need help, please open it.","GREETINGS","grammar_errors","Start chat"]]}