{"columns":["index","content_index","url","title","sub_intent","user_message","ground_truth"],"data":[["1","1","https://www.corridorplatforms.com/post/exl-invests-in-corridor-platforms-a-big-data-credit-risk-management-platform","EXL invests in Corridor Platforms – a big data credit risk management platform","Corporate Profile and Strategy","What type of company is ExlService?","ExlService is a leading operations management and analytics company that offers services in insurance, banking, financial services, utilities, healthcare, travel, transportation, and logistics."],["2","1","https://www.corridorplatforms.com/post/exl-invests-in-corridor-platforms-a-big-data-credit-risk-management-platform","EXL invests in Corridor Platforms – a big data credit risk management platform","Corporate Profile and Strategy","What is Corridor Platforms described as?","Corridor Platforms is a state-of-the-art Decision and Analytics workflow automation platform. It helps institutions upgrade to advanced analytics and real-time decisioning capabilities with systematic governance and compliance."],["3","1","https://www.corridorplatforms.com/post/exl-invests-in-corridor-platforms-a-big-data-credit-risk-management-platform","EXL invests in Corridor Platforms – a big data credit risk management platform","Corporate Profile and Strategy","Who does Corridor Platforms collaborate with to solve GenAI governance for banks?","Corridor Platforms collaborates with Google Cloud to solve GenAI governance for banks."],["4","2","https://www.corridorplatforms.com/insights/tags/press-release","Press Release | Corridor Platforms","Corporate Profile and Strategy","Who is Corridor Platforms collaborating with to solve GenAI governance for banks?","Corridor Platforms collaborates with Google Cloud to solve GenAI governance for banks."],["5","2","https://www.corridorplatforms.com/insights/tags/press-release","Press Release | Corridor Platforms","Corporate Profile and Strategy","With whom did Corridor announce a strategic partnership to serve credit unions?","Corridor announced a strategic partnership with Datava to revolutionize data and decision management for credit unions."],["6","2","https://www.corridorplatforms.com/insights/tags/press-release","Press Release | Corridor Platforms","Corporate Profile and Strategy","What is the goal of the partnership between Datava and Corridor?","The strategic partnership between Datava and Corridor aims to revolutionize data and decision management for credit unions."],["7","3","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/database/","Metadata: Database Setup - Corridor GGX Documentation","Platform Architecture and Technology","What is the function of the metadata database?","The metadata database stores all the information entered into the Web Application in a structured format so it can be efficiently used by other components."],["8","3","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/database/","Metadata: Database Setup - Corridor GGX Documentation","Platform Architecture and Technology","Which four database options does the platform currently support?","The platform currently supports the following databases: Oracle Database, SQLite, MS SQL, and PostgreSQL."],["9","3","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/database/","Metadata: Database Setup - Corridor GGX Documentation","Platform Architecture and Technology","Which database option is intended for testing purposes only?","SQLite is the database option meant for testing purposes only."],["10","4","https://www.corridorplatforms.com/post/launching-corridor-s-gen-ai-governance-platform","Launching Corridor's Gen AI Governance Platform","Core Product : GenGuardX","For regulated entities, what is critical for deploying Gen AI use cases into production?","For a regulated entity to deploy meaningful Gen AI use cases into production, it is critical to have complete control of the LLM pipeline."],["11","4","https://www.corridorplatforms.com/post/launching-corridor-s-gen-ai-governance-platform","Launching Corridor's Gen AI Governance Platform","Core Product : GenGuardX","What does Corridor Platforms' Gen AI governance platform provide?","Corridor Platforms' Gen AI governance platform provides governance across the entire build and analytical life cycle, along with pre and post-production monitoring."],["12","4","https://www.corridorplatforms.com/post/launching-corridor-s-gen-ai-governance-platform","Launching Corridor's Gen AI Governance Platform","Core Product : GenGuardX","Give some example of a meaningful Gen AI use case ?","An example of a meaningful Gen AI use case could be agent assist or IVR usecase. "],["13","5","https://ggx.corridorplatforms.com/","GenGuardX - Responsible AI and Governance in GenAI","Core Product : GenGuardX","What primary challenge does Corridor GGX address for organizations using generative AI?","The primary challenge Corridor GGX addresses is that responsibly using Generative AI is difficult because off-the-shelf solutions often fall short of regulatory standards. This creates undefined risks and makes it a daunting challenge for organizations to evaluate the new risks that GenAI tools and agents bring."],["14","5","https://ggx.corridorplatforms.com/","GenGuardX - Responsible AI and Governance in GenAI","Core Product : GenGuardX","What new GenAI-specific risks, such as hallucination and toxicity, does the platform test for?","The platform tests for new GenAI risks that need to be identified and tested, such as Hallucination and Toxicity. It also offers tests for Tone."],["15","5","https://ggx.corridorplatforms.com/","GenGuardX - Responsible AI and Governance in GenAI","Core Product : GenGuardX","What capabilities are included in the entry-level LITE plan for GenAi?","The LITE plan is designed for those starting their GenAI journey and includes Fair Lending Tests, Toxicity & Tone Tests, Simulations on Curated Data, connection with common LLMs, and Standard Versioning and Activity Tracking."],["16","6","https://www.corridorplatforms.com/post/a-prescriptive-playbook-to-manage-credit-risk-in-uncertain-times","A Prescriptive Playbook to Manage Credit Risk in Uncertain times","Risk Management Insights","Why have credit write-offs remained at pre-pandemic levels despite decreased profitability for most financial institutions?","Credit write-offs have remained at pre-pandemic levels because large financial institutions had adequate capital before COVID-19. This, combined with timely government assistance, proactive cost control, and customer assistance actions taken during the pandemic, has allowed these institutions to remain healthy."],["17","6","https://www.corridorplatforms.com/post/a-prescriptive-playbook-to-manage-credit-risk-in-uncertain-times","A Prescriptive Playbook to Manage Credit Risk in Uncertain times","Risk Management Insights","What challenges have Fin-techs faced due to inadequate investment in credit risk controls?","Fin-techs that have not invested in adequate end-to-end credit risk controls have suffered from an absence of liquidity, limited demand for new loans, and a sharp rise in credit losses. As a result, many have been restructured and merged with larger institutions."],["18","6","https://www.corridorplatforms.com/post/a-prescriptive-playbook-to-manage-credit-risk-in-uncertain-times","A Prescriptive Playbook to Manage Credit Risk in Uncertain times","Risk Management Insights","Which critical assets should an institution own, versus which platforms are best to outsource?","An institution should own assets such as 'Data', 'decision scientists', and 'expert credit professionals'. Conversely, certain risk management platforms, like model studios and workflow management capabilities, are best outsourced because they are expensive to build and keep current."],["19","7","https://www.corridorplatforms.com/post/transforming-banking-decisions-the-need-for-speed-and-agility-with-governance","Transforming Banking Decisions – the need for Speed and Agility with Governance","Risk Management Insights","What is the competitive imperative for banks to survive and stay ahead for the next 18-24 months?","Speed of response while ensuring safety (compliance) is the competitive imperative for banks to survive and stay ahead of peers for the next 18-24 months."],["20","7","https://www.corridorplatforms.com/post/transforming-banking-decisions-the-need-for-speed-and-agility-with-governance","Transforming Banking Decisions – the need for Speed and Agility with Governance","Risk Management Insights","What problem does the Corridor solution address regarding the manual model tracking process at banks?","The model tracking process at banks is often manual and time-consuming due to inefficiencies across systems and a lack of standardization. This leads to delays in identifying model degradation issues and hinders the ability to react quickly in a fast-evolving consumer landscape."],["21","7","https://www.corridorplatforms.com/post/transforming-banking-decisions-the-need-for-speed-and-agility-with-governance","Transforming Banking Decisions – the need for Speed and Agility with Governance","Risk Management Insights","How does the platform facilitate the auditability of a decision after it has been deployed?","The platform facilitates the auditability of a decision after the fact through a standalone artifact. It maintains all versions of policies, as well as associated models, features, and data elements, to provide clear transparency for the decision logic if it needs to be validated by regulators or internal compliance."],["22","8","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/approvals/","CI CD Integrations - Corridor GGX Documentation","Platform Architecture and Technology","How does Corridor integrate with third-party applications to handle object reviews?","Corridor integrates with third-party applications for object reviews using API calls. This is accomplished by defining a custom handler, `CustomApprovalHandler`, that inherits from Corridor's base `ApprovalHandler` class. The logic for the approval process is then defined within the `send_action` and `receive_action` methods of this custom handler."],["23","8","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/approvals/","CI CD Integrations - Corridor GGX Documentation","Platform Architecture and Technology","What two methods must be defined within the CustomApprovalHandler class to manage the approval logic?","The two methods that must be defined within the `CustomApprovalHandler` class to manage the approval logic are `send_action(review, action)` and `receive_action(review_id, payload)`."],["24","8","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/approvals/","CI CD Integrations - Corridor GGX Documentation","Platform Architecture and Technology","In which file are the third-party approval handler configurations set?","Approval handler-related configurations need to be set in `api_config.py` along with other configurations."],["25","9","https://ggx.corridorplatforms.com/customer-stories","GenGuardX - Case Studies and Success stories with our customers","Risk Management Insights","What was the bank's primary goal for implementing an automated LLM pipeline?","The bank's primary goal for implementing an automated LLM pipeline was to reduce manual intervention for specific customer requests."],["26","9","https://ggx.corridorplatforms.com/customer-stories","GenGuardX - Case Studies and Success stories with our customers","Risk Management Insights","What were the main challenges the bank faced when finalizing its GenAI solution?","The bank faced significant hurdles in finalizing its automated LLM pipeline solution due to governance, regulatory, and performance concerns."],["27","9","https://ggx.corridorplatforms.com/customer-stories","GenGuardX - Case Studies and Success stories with our customers","Risk Management Insights","How did the GGX platform address governance and compliance for the bank's system?","The GGX platform addressed governance and compliance by establishing comprehensive audit trails and approval workflows, which ensured adherence to regulatory requirements."],["28","10","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/bundle-install/","Install using scripts - Corridor GGX Documentation","Platform Architecture and Technology","What is the default installation directory for the Corridor package?","The default installation directory for the Corridor package is /opt/corridor."],["29","10","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/bundle-install/","Install using scripts - Corridor GGX Documentation","Platform Architecture and Technology","Which command must be run to initialize the API server database?","To initialize the database, the `corridor-api db upgrade` command needs to be run."],["30","10","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/bundle-install/","Install using scripts - Corridor GGX Documentation","Platform Architecture and Technology","Which web server configuration should be avoided for production environments?","The Werkzeug web server configuration should be avoided for production."],["31","11","https://www.corridorplatforms.com/post/implementing-a-prospecting-policy-to-optimize-offers-to-prospects-based-on-lifetime-profitability","Implementing a Prospecting Policy to Optimize Offers to Prospects Based on Lifetime Profitability","Risk Management Insights","What is the primary function of the Corridor Platforms software?","Corridor Platforms is a decision workflow governance and automation capability designed to rapidly transform risk and marketing decisioning at banks. It enables them to leverage new data, AI, and automation to achieve competitive excellence in revenue growth, risk control, and operating efficiency."],["32","11","https://www.corridorplatforms.com/post/implementing-a-prospecting-policy-to-optimize-offers-to-prospects-based-on-lifetime-profitability","Implementing a Prospecting Policy to Optimize Offers to Prospects Based on Lifetime Profitability","Risk Management Insights","What framework does the platform use to optimize offers for prospects in real time?","Corridor Platforms leverages a sophisticated lifetime value (LTV) framework to optimize offers for prospects in real time."],["33","11","https://www.corridorplatforms.com/post/implementing-a-prospecting-policy-to-optimize-offers-to-prospects-based-on-lifetime-profitability","Implementing a Prospecting Policy to Optimize Offers to Prospects Based on Lifetime Profitability","Risk Management Insights","How does the platform manage which offers are displayed to different prospect segments?","Corridor Platforms facilitates real-time strategy adjustments, allowing you to monitor and modify strategies through evaluations and automated dashboards to reduce risk. The platform also provides real-time alerts so you can promptly take corrective actions."],["34","12","https://ggx-docs.corridorplatforms.com/technology/self-hosting/hardening/","Hardening - Security - Corridor GGX Documentation","Platform Architecture and Technology","Which data storage location is intended only for short-term storage?","Redis is the data storage location used only for short-term storage."],["35","12","https://ggx-docs.corridorplatforms.com/technology/self-hosting/hardening/","Hardening - Security - Corridor GGX Documentation","Platform Architecture and Technology","For which component are no specific security hardening steps required?","No specific steps are required for the API - Celery workers, as no other component connects to it directly."],["36","12","https://ggx-docs.corridorplatforms.com/technology/self-hosting/hardening/","Hardening - Security - Corridor GGX Documentation","Platform Architecture and Technology","What security protocol is recommended for securing connections between Spark components?","Kerberos is the recommended protocol for securing connections between Spark - Celery / Jupyter and Spark."],["37","13","https://www.corridorplatforms.com/how-we-help/business-strategy","How We Help Business Strategy | Corridor Platforms","Corporate Profile and Strategy","What tool allows users to build strategies without relying on technology teams?","Corridor Platforms’ No-Code rule writer allows users to build and test policies without dependence on modeling and technology teams. It enables the building and refining of underwriting and customer management strategies by leveraging approved data, features, and models."],["38","13","https://www.corridorplatforms.com/how-we-help/business-strategy","How We Help Business Strategy | Corridor Platforms","Corporate Profile and Strategy","How can users assess the impact of strategy changes before deployment?","Users can assess the impact of strategy changes by simulating them in an analytical environment using automated comparison and backcasting tools. This allows for a detailed rule-level impact analysis for an entire sample or a single record with one click."],["39","13","https://www.corridorplatforms.com/how-we-help/business-strategy","How We Help Business Strategy | Corridor Platforms","Corporate Profile and Strategy","What features help users monitor strategies and take prompt corrective actions?","Users can track and monitor strategies through standardized evaluations and automated monitoring dashboards. They also receive real-time alerts to take prompt corrective actions."],["40","14","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/reporting/","Reporting - Corridor GGX Documentation","Core Product : GenGuardX","What are the three core components that make up a report?","A typical report is comprised of three components: Data Source, which are the foundational datasets for deriving insights; Computation Logic, which includes the processing and transformations applied to the data; and Visualization Logic, which is the presentation of results using charts, tables, and other visual elements."],["41","14","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/reporting/","Reporting - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of creating a Dashboard View?","Dashboard Views are created to specify and organize the report outputs that should be generated from a job's output. This allows for the precise selection of reports to be executed and the customization of the dashboard's layout, including its tab structure, content arrangement, plot order, and the height and width of each plot."],["42","14","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/reporting/","Reporting - Corridor GGX Documentation","Core Product : GenGuardX","What are the three supported job types when registering a report?","The three supported job types for report registration are Simulation, Comparison, and Validation."],["43","15","https://www.corridorplatforms.com/post/corridor-platforms-partners-with-jam-fintop","Corridor Platforms Partners with JAM FINTOP","Corporate Profile and Strategy","What challenges do mid-tier banks face in achieving real-time decisioning capabilities?","Mid-tier banks may encounter obstacles in achieving high-quality, real-time decisioning capabilities due to legacy data infrastructure, competition for analytical talent, and manual or inefficient compliance processes."],["44","15","https://www.corridorplatforms.com/post/corridor-platforms-partners-with-jam-fintop","Corridor Platforms Partners with JAM FINTOP","Corporate Profile and Strategy","What is the purpose of the Risk Decisioning-as-a-Service (RDaaS) offering?","The Risk Decisioning-as-a-Service (RDaaS) offering enables turnkey digital lending and deposit programs for mid-size banks, credit unions, and credit card providers. It leverages advanced analytics, AI, and the cloud to deliver instant decisions necessary to support digital initiatives such as point-of-sale financing, digital loans, cross-selling, deposit pricing, and real-time credit limit changes."],["45","15","https://www.corridorplatforms.com/post/corridor-platforms-partners-with-jam-fintop","Corridor Platforms Partners with JAM FINTOP","Corporate Profile and Strategy","What is the intended long-term outcome for banks that use Corridor's platform?","The intended long-term outcome for banks using Corridor's platform is to become self-dependent. The platform transfers critical know-how and transformational capabilities to the bank, reducing their continued dependency on third-party providers for core functions that regulators expect to be in-house."],["46","16","https://www.corridorplatforms.com/bjoern","Connect with Bjoern | Corridor Platforms","Corporate Profile and Strategy","Who is the VP of Sales at Corridor Platforms?","Bjoern is the VP of Sales at Corridor Platforms."],["47","16","https://www.corridorplatforms.com/bjoern","Connect with Bjoern | Corridor Platforms","Corporate Profile and Strategy","What is Bjoern's role at Corridor Platforms?","Bjoern is the VP of Sales at Corridor Platforms."],["48","17","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/direct-to-production/","CICD & Direct to Production - Corridor GGX Documentation","Core Product : GenGuardX","What is a key benefit of using production artifacts in an environment separate from the Corridor platform?","A key benefit is that there is no extra dependency required on the production side from Corridor. This means there is no requirement for a license key or a Corridor installation in the production environment."],["49","17","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/direct-to-production/","CICD & Direct to Production - Corridor GGX Documentation","Core Product : GenGuardX","What information is contained within the `metadata.json` file of a production artifact?","The `metadata.json` file contains metadata information about the folder it is in. It includes information about the model, its inputs, its dependent variable, and any other metadata registered in the platform, such as Groups and Permissible Purpose."],["50","17","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/direct-to-production/","CICD & Direct to Production - Corridor GGX Documentation","Core Product : GenGuardX","How can a production artifact be deployed in a system that supports calling APIs?","If a production system supports calling APIs, the production artifact can be wrapped in an API layer and exposed as a REST or SOAP API. These artifacts can be deployed using containerized solutions like Docker Compose, Kubernetes, and AWS Elastic Container Service (ECS), or with application management solutions such as AWS Beanstalk, AWS Lambda, and Azure App Service."],["51","18","https://www.corridorplatforms.com/legal-accessibility-statement","Accessibility Statement | Corridor Platforms","Corporate Profile and Strategy","What is the Corridor Platform's conformance level with the Web Content Accessibility Guidelines?","Corridor Platform is fully conformant with WCAG 2.1 level AA, which means the content fully conforms to the accessibility standard without any exceptions."],["52","18","https://www.corridorplatforms.com/legal-accessibility-statement","Accessibility Statement | Corridor Platforms","Corporate Profile and Strategy","What are some of the measures Corridor Platforms takes to ensure accessibility?","To ensure accessibility, Corridor Platforms includes it as part of its mission statement and internal policies, appoints an accessibility officer, provides continual accessibility training for its staff, and assigns clear accessibility goals and responsibilities."],["53","18","https://www.corridorplatforms.com/legal-accessibility-statement","Accessibility Statement | Corridor Platforms","Corporate Profile and Strategy","Which assistive technologies are recommended for use with the Corridor Platform?","Corridor Platform is designed to be compatible with specific assistive technologies. For Windows, NVDA is recommended, and for OSX, Voice Over is recommended."],["54","19","https://www.corridorplatforms.com/post/meet-the-finalists-for-the-2025-callahan-associates-innovation-series-analytics","Meet The Finalists For The 2025 Callahan & Associates Innovation Series: Analytics","Risk Management Insights","What challenge does the RiskDecisioning.AI platform solve for mid-market financial institutions?","The RiskDecisioning.AI platform addresses the significant challenges mid-market financial institutions (FIs) face when competing against Tier 1 FIs and aggressive fintechs for digital loan applicants. Mid-market FIs are often constrained by outdated systems, fragmented data, and limited decisioning capabilities, which leaves them struggling to compete effectively and can result in subpar customer relationships, increased portfolio risk, and the loss of members."],["55","19","https://www.corridorplatforms.com/post/meet-the-finalists-for-the-2025-callahan-associates-innovation-series-analytics","Meet The Finalists For The 2025 Callahan & Associates Innovation Series: Analytics","Risk Management Insights","What is the key benefit of RiskDecisioning.AI's \"whitebox transparency\" feature?","Unlike black box score providers, the whitebox transparency feature of RiskDecisioning.AI grants credit unions full access to decision logic, which enables internal capability building and ensures compliance without vendor dependency."],["56","19","https://www.corridorplatforms.com/post/meet-the-finalists-for-the-2025-callahan-associates-innovation-series-analytics","Meet The Finalists For The 2025 Callahan & Associates Innovation Series: Analytics","Risk Management Insights","What data source allows Powerlytics to provide zero-friction income verification solutions?","Powerlytics’ income estimates and confidence scores are underpinned by anonymized IRS tax return data, which allows the company to provide zero-friction income verification."],["57","20","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/oversight/","Governance Oversight - Corridor GGX Documentation","Core Product : GenGuardX","What is the Monitoring Dashboard designed to provide to its users?","The Monitoring Dashboard provides users with a comprehensive overview of all registered objects and activities on the platform. It offers an interface to access snapshots, trend statistics, and metadata information such as properties, attributes, and statuses for various objects, jobs, and users."],["58","20","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/oversight/","Governance Oversight - Corridor GGX Documentation","Core Product : GenGuardX","What four actions can be triggered by a custom alert?","The four actions that can be triggered by a custom alert are: Send Notification to selected users or user roles; Add Alert Flag to the object responsible for the alert; Create Review for approved objects and assign reviewers; and Send Email to external users."],["59","20","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/oversight/","Governance Oversight - Corridor GGX Documentation","Core Product : GenGuardX","What review statuses are displayed in the Last Review Status View?","The Last Review Status View displays the following review statuses: Accepted with Flag, Accepted without Flag, Pending Acceptance, and Rejected."],["60","21","https://www.corridorplatforms.com/how-we-help/leadership","How We Help: Leadership | Corridor Platforms","Corporate Profile and Strategy","What features does Corridor Platforms offer to manage governance and compliance?","Corridor Platforms offers inbuilt automation and end-to-end governance to manage governance and compliance across the entire decision lifecycle, eliminate regulatory risks, and keep pace with market dynamics."],["61","21","https://www.corridorplatforms.com/how-we-help/leadership","How We Help: Leadership | Corridor Platforms","Corporate Profile and Strategy","How does the platform support experimentation with AI while maintaining governance?","The platform's inbuilt automation and end-to-end governance allow users to continually advance and experiment with the latest AI capabilities while maintaining strong compliance and governance."],["62","21","https://www.corridorplatforms.com/how-we-help/leadership","How We Help: Leadership | Corridor Platforms","Corporate Profile and Strategy","How does the platform help clients compete with leading banks and fintechs?","The platform helps clients compete with leading banks and fintechs by accelerating their digitization journey and allowing them to gain a competitive edge by tapping into the knowledge and experience of first movers. This enables them to leapfrog to best-in-class with speed and win the best digital consumers."],["63","22","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/docker/","Install using Docker - Corridor GGX Documentation","Platform Architecture and Technology","What does Corridor provide to help bootstrap a Docker-based installation?","To bootstrap a Docker-based installation, Corridor provides production-ready Dockerfile templates along with the installation bundle."],["64","22","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/docker/","Install using Docker - Corridor GGX Documentation","Platform Architecture and Technology","What is the minimum required version of Docker Engine for the installation?","The minimum required version for Docker Engine is v20.10+."],["65","22","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/docker/","Install using Docker - Corridor GGX Documentation","Platform Architecture and Technology","What are the two methods for managing platform configurations in a Docker deployment?","Platform configurations can be managed by mounting them from a host or persistent volume in read-only mode, or through environment variables during deployment."],["66","23","https://www.corridorplatforms.com/careers","Careers | Corridor Platforms","Corporate Profile and Strategy","What technical skills are required for the UI Lead Engineer position?","The UI Lead Engineer position requires a strong command of Angular, advanced state management, and a deep understanding of designing complex architectures in a monorepo environment. The role also focuses on data visualization, seamless integration with Python-based backends, and expertise in UI/UX design for high-performance, user-friendly interfaces."],["67","23","https://www.corridorplatforms.com/careers","Careers | Corridor Platforms","Corporate Profile and Strategy","What types of applications will the Senior Product Designer work on?","The Senior Product Designer will contribute to multiple products, including the Core Risk Decisioning Platform and LLM/GenAI-powered applications."],["68","23","https://www.corridorplatforms.com/careers","Careers | Corridor Platforms","Corporate Profile and Strategy","Which teams will the Senior Product Designer support in addition to product development?","The Senior Product Designer will support the Marketing and Sales teams by creating compelling brand-aligned visual assets."],["69","24","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/pipelines/","Pipelines - Corridor GGX Documentation","Core Product : GenGuardX","What is the difference between Chat-based and Free-Flow pipelines?","Chat-based pipelines maintain history and context across multiple user messages and pipeline responses, enabling context-aware interactions. In contrast, Free-Flow pipelines process one input at a time, generating a single output without retaining context from previous interactions."],["70","24","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/pipelines/","Pipelines - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of the Pipeline Registry?","The Pipeline Registry organizes all registered pipelines into customized groups at a centralized location, allowing for easier tracking, monitoring, and new pipeline creation."],["71","24","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/pipelines/","Pipelines - Corridor GGX Documentation","Core Product : GenGuardX","What are the three main components of a typical pipeline?","A typical pipeline consists of three main components: Resources (such as Models, RAGs, Prompts, and Guardrails), Pipeline Initialization Logic, and Pipeline Scoring Logic."],["72","25","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/datalake/","Datalake Integration - Corridor GGX Documentation","Platform Architecture and Technology","What types of data formats can Corridor connect to within a data lake?","Corridor can connect to data lakes that have data saved in formats such as parquet, orc, avro, hive tables, or any other format."],["73","25","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/datalake/","Datalake Integration - Corridor GGX Documentation","Platform Architecture and Technology","Which two functions must be defined to create a custom data source handler?","To create a custom data source handler, the user must define the `read_from_location` and `write_to_location` functions."],["74","25","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/datalake/","Datalake Integration - Corridor GGX Documentation","Platform Architecture and Technology","How is a custom handler class configured in the api_config.py file?","A custom handler class is configured in the `api_config.py` file by setting the `LAKE_DATA_SOURCE_HANDLER` variable to the path of the handler. For example, if the handler is defined in a file named `hive_table_handler.py`, the configuration would be: `LAKE_DATA_SOURCE_HANDLER = 'hive_table_handler.HiveTable'`."],["75","26","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/rags/","RAGs - Corridor GGX Documentation","Core Product : GenGuardX","How does Retrieval-Augmented Generation enhance language models?","Retrieval-Augmented Generation (RAG) enhances language models by integrating a retrieval mechanism that fetches relevant external information in real-time. This process allows the model to generate more accurate, up-to-date, and context-aware responses that extend beyond its pre-trained knowledge."],["76","26","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/rags/","RAGs - Corridor GGX Documentation","Core Product : GenGuardX","What are the three main components of a RAG system's retrieval mechanism?","The retrieval mechanism in a RAG system typically consists of a Knowledge Source (a repository of external information), Initialization Logic (to prepare the knowledge source for processing requests), and Retrieval Logic (a set of algorithms designed to fetch the most relevant information based on inputs)."],["77","26","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/rags/","RAGs - Corridor GGX Documentation","Core Product : GenGuardX","What types of retrieval systems can be registered within the GGX platform?","GGX supports the registration of three types of Retrieval Systems: API-based Retrieval, which communicates with external knowledge sources using APIs; Python-based Retrieval, for lightweight Python logic and rule-based systems; and Custom Retrieval, which leverages uploaded knowledge sources like CSV and vector databases."],["78","27","https://www.corridorplatforms.com/insights/tags/corridorgoogle","CorridorGoogle | Corridor Platforms","Corporate Profile and Strategy","What specific problem is the collaboration between Corridor Platforms and Google Cloud intended to solve?","The collaboration between Corridor Platforms and Google Cloud is intended to solve GenAI governance for banks."],["79","28","https://www.corridorplatforms.com/post/corridor-platforms-collaborates-with-google-cloud-to-solve-genai-governance-for-banks","Corridor Platforms collaborates with Google Cloud to solve GenAI governance for banks","Corporate Profile and Strategy","What is the purpose of the partnership between Corridor Platforms and Google Cloud?","The partnership between Corridor Platforms and Google Cloud aims to help financial institutions unlock the full potential of customer-facing GenAI applications while adhering to rigorous regulatory and compliance standards. It enables banks to deploy these applications with confidence by leveraging Corridor’s GenGuardX platform for robust governance, compliance, and risk management."],["80","28","https://www.corridorplatforms.com/post/corridor-platforms-collaborates-with-google-cloud-to-solve-genai-governance-for-banks","Corridor Platforms collaborates with Google Cloud to solve GenAI governance for banks","Corporate Profile and Strategy","What specific GenAI risks does the GenGuardX platform help manage for financial institutions?","The GenGuardX (GGX) platform addresses traditional risks as well as emerging risks such as hallucinations, PII leakage, new fair lending biases, and jailbreaking vulnerabilities."],["81","28","https://www.corridorplatforms.com/post/corridor-platforms-collaborates-with-google-cloud-to-solve-genai-governance-for-banks","Corridor Platforms collaborates with Google Cloud to solve GenAI governance for banks","Corporate Profile and Strategy","Who did Corridor Platforms collaborate with to develop the GGX platform?","The GGX platform was developed in collaboration with leading GenAI governance experts at Oliver Wyman and was rigorously tested through a joint initiative involving Google Cloud and a Tier 1 G-SIB banking client."],["82","29","https://www.corridorplatforms.com/post/exl-oliver-wyman-corridor-platforms-team-up-to-launch-real-time-risk-decisioning-solution-for-fis","EXL, Oliver Wyman & Corridor Platforms team up to launch real-time risk decisioning solution for FIs","Corporate Profile and Strategy","Which three companies formed a joint venture for a risk decisioning-as-a-service solution?","EXL, Corridor Platforms, and Oliver Wyman announced a joint venture to develop a risk decisioning-as-a-service solution for financial institutions."],["83","29","https://www.corridorplatforms.com/post/exl-oliver-wyman-corridor-platforms-team-up-to-launch-real-time-risk-decisioning-solution-for-fis","EXL, Oliver Wyman & Corridor Platforms team up to launch real-time risk decisioning solution for FIs","Corporate Profile and Strategy","What disadvantage do mid-sized banks face compared to national players in digital lending?","The rapid growth of digital lending has put mid-sized and regional banks at a significant disadvantage compared to national players who have the tech infrastructure in place to support real-time decisioning."],["84","29","https://www.corridorplatforms.com/post/exl-oliver-wyman-corridor-platforms-team-up-to-launch-real-time-risk-decisioning-solution-for-fis","EXL, Oliver Wyman & Corridor Platforms team up to launch real-time risk decisioning solution for FIs","Corporate Profile and Strategy","What is the long-term goal of the 'build, operate, transfer' model for client banks?","The long-term goal of the 'build, operate, transfer' model is to transfer critical know-how to client banks so that they become self-dependent in the long run."],["85","30","https://www.corridorplatforms.com/blank-8-1","Copy of AI Sandboxv1 | Corridor Platforms","Corporate Profile and Strategy","What does the Responsible AI Sandbox enable financial institutions to do?","The Responsible AI Sandbox is a live, guided environment where financial institutions can test GenAI applications, measure and mitigate emerging novel risks, and confidently move from experimentation to scalable, high-impact deployments."],["86","30","https://www.corridorplatforms.com/blank-8-1","Copy of AI Sandboxv1 | Corridor Platforms","Corporate Profile and Strategy","What is the primary application focus of the sandbox program?","The primary application focus of the Responsible AI Sandbox is Conversational IVR."],["87","30","https://www.corridorplatforms.com/blank-8-1","Copy of AI Sandboxv1 | Corridor Platforms","Corporate Profile and Strategy","What is the expected outcome for institutions that participate in AI Sandbox?","The expected outcome for participating institutions is a validated GenAI use case, risk controls, and a deployment roadmap."],["88","31","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/annotation-queues/","Annotation Queues - Corridor GGX Documentation","Core Product : GenGuardX","What is the primary purpose of the Annotation Queue capability?","The Annotation Queue capability is designed to facilitate human evaluation and labeling of production data in an efficient way to reduce human error. This allows for the validation of model outputs in real time by having annotators assess and label the production outcome."],["89","31","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/annotation-queues/","Annotation Queues - Corridor GGX Documentation","Core Product : GenGuardX","How do Annotation Queues improve upon using spreadsheets for data annotation?","Annotation Queues improve upon the use of Excel and Google Sheets by creating a more transparent and auditable system to monitor live performance."],["90","31","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/annotation-queues/","Annotation Queues - Corridor GGX Documentation","Core Product : GenGuardX","Why is a human element considered important for monitoring production activity?","A human element is important for monitoring production activity because not all trends can be caught in an automated way. New trends, in particular, are not always caught using programmatic approaches."],["91","32","https://www.corridorplatforms.com/job-board/senior-product-designer","Senior Product Designer","Corporate Profile and Strategy","What types of products will the Product Designer help create?","The Product Designer will contribute to the Core Risk Decisioning Platform and LLM/GenAI-powered applications. They will also design user experiences for Core Fintech and GenAI product interfaces and create visual assets such as presentations, social media graphics, and product visuals for the Sales and Marketing teams."],["92","32","https://www.corridorplatforms.com/job-board/senior-product-designer","Senior Product Designer","Corporate Profile and Strategy","What specific industry experience is required for this design role?","The role requires prior experience designing fintech products, with exposure to AI-driven or LLM-based platforms."],["93","32","https://www.corridorplatforms.com/job-board/senior-product-designer","Senior Product Designer","Corporate Profile and Strategy","What is the minimum required experience for the Product Designer position?","The minimum required experience for the Product Designer position is 3+ years as a Product Designer, UI/UX Designer, or an equivalent role."],["94","33","https://www.corridorplatforms.com/job-board/customer-service-representative","Customer Service Representative","Corporate Profile and Strategy","What role is detailed in the job description for Software Engineers?","The job description details the role of a Software Engineer, who is responsible for designing, developing, and maintaining software applications."],["95","33","[object Object]","Customer Service Representative","Corporate Profile and Strategy","In which city is this Customer Service Representative job position based?","The job position is based in Bangalore, IN."],["96","33","https://www.corridorplatforms.com/job-board/customer-service-representative","Customer Service Representative","Corporate Profile and Strategy","What are the primary responsibilities for the Software Engineer position?","A Software Engineer is responsible for designing, developing, and maintaining software applications that deliver value to customers. The role also requires writing clean, efficient, and scalable code and collaborating with cross-functional teams to build robust software solutions."],["97","34","https://ggx.corridorplatforms.com/get-started","Contact Us - GenGuardX - GenAI Governance","Core Product : GenGuardX","What types of risks can be identified by performing comprehensive model tests?","By performing comprehensive model tests, you can identify risks, bias, and hallucinations."],["98","34","https://ggx.corridorplatforms.com/get-started","Contact Us - GenGuardX - GenAI Governance","Core Product : GenGuardX","How does the platform achieve robust GenAI governance?","The platform achieves robust GenAI governance by combining Human-Integrated Testing to balance automation with expert oversight."],["99","34","https://ggx.corridorplatforms.com/get-started","Contact Us - GenGuardX - GenAI Governance","Core Product : GenGuardX","What is the function of the GenAI Hub?","The GenAI Hub centralizes AI assets, enabling seamless tracking, versioning, monitoring, and compliance."],["100","35","https://www.corridorplatforms.com/blank-7","Gen AI Sandbox  | Corridor Platforms","Corporate Profile and Strategy","What is the primary purpose of the Responsible AI Sandbox?","The Responsible AI Sandbox is a live, guided environment where financial institutions can test GenAI applications, measure and mitigate emerging novel risks, and confidently move from experimentation to scalable, high-impact deployments."],["101","35","https://www.corridorplatforms.com/blank-7","Gen AI Sandbox  | Corridor Platforms","Corporate Profile and Strategy","What types of risks can be simulated within the Interactive Risk Lab?","The Interactive Risk Lab allows users to simulate critical issues such as hallucinations, bias, toxicity, and privacy leakage."],["102","35","https://www.corridorplatforms.com/blank-7","Gen AI Sandbox  | Corridor Platforms","Corporate Profile and Strategy","What does the Audit-Ready Compliance feature automatically generate?","The Audit-Ready Compliance feature auto-generates documentation, model lineage, and approval workflows for internal and regulatory requirements."],["103","36","https://ggx-docs.corridorplatforms.com/register-and-refine/version-management/","Version Management - Corridor GGX Documentation","Core Product : GenGuardX","What is version management?","Version management is the process of systematically tracking, organizing, and controlling changes to an object. A version of an object is created every time the object’s definition is either newly created or subsequently changed."],["104","36","https://ggx-docs.corridorplatforms.com/register-and-refine/version-management/","Version Management - Corridor GGX Documentation","Core Product : GenGuardX","How can an approved item be modified on the platform?","Once an item is approved, it cannot be modified. To make changes, a clone must be created, which becomes a new version of the item that can be worked on."],["105","36","https://ggx-docs.corridorplatforms.com/register-and-refine/version-management/","Version Management - Corridor GGX Documentation","Core Product : GenGuardX","What is a key benefit of maintaining a comprehensive change history?","Maintaining a comprehensive change history is important for several reasons: it enhances traceability, improves accountability, facilitates debugging, ensures compliance with regulations, and builds trust by providing transparency into model evolution."],["106","37","https://www.corridorplatforms.com/how-we-help","How We Help | Corridor Platforms","Corporate Profile and Strategy","What are the five key areas of focus for Corridor Platforms?","The five key areas of focus for Corridor Platforms are Leadership, Technology, Modeling, Business Strategy, and Governance."],["107","38","https://www.corridorplatforms.com/home-3-1-2","Corridor Platforms | Decision Workflow Governance & Automation","Corporate Profile and Strategy","What is the primary function of the Corridor Platforms' workflow automation system?","Corridor Platforms' Decision and Analytics workflow automation platform helps institutions upgrade to advanced analytics and real-time decisioning capabilities with a bedrock of systematic governance and compliance in the most efficient manner."],["108","38","https://www.corridorplatforms.com/home-3-1-2","Corridor Platforms | Decision Workflow Governance & Automation","Corporate Profile and Strategy","What are the three pillars of the next-gen decision intelligence platform?","The three pillars of the next-gen decision intelligence platform are: Shared Workspace With Governance, System of Record for Data and Decision Analysis, and Direct to Production With No-Recode or Checks."],["109","38","https://www.corridorplatforms.com/home-3-1-2","Corridor Platforms | Decision Workflow Governance & Automation","Corporate Profile and Strategy","What are the projected impacts on cost reduction and customer growth from using the platform?","The projected impact of using the platform is a 20-30% reduction in costs and a 10-20% growth in customers."],["110","39","https://www.corridorplatforms.com/post/model-management-in-banking-during-the-crisis-a-corridor-platform-driven-approach","Model Management in Banking during the Crisis – A Corridor Platform driven approach","Risk Management Insights","What are the four components of the closed-loop model management process in banking?","Model Management is a closed-loop process that involves model development/calibration, model validation, deployment, and model monitoring."],["111","39","https://www.corridorplatforms.com/post/model-management-in-banking-during-the-crisis-a-corridor-platform-driven-approach","Model Management in Banking during the Crisis – A Corridor Platform driven approach","Risk Management Insights","How does the Corridor Platform help create short-term model fixes during a crisis?","The Corridor Platform (CP) features an \"English like\" rule writer that helps enhance models with expert judgment-based overlays quickly. This is essential during a crisis period with limited data availability, allowing for short-term model fixes like implementing stricter underwriting rules for the worst-affected customer segments."],["112","39","https://www.corridorplatforms.com/post/model-management-in-banking-during-the-crisis-a-corridor-platform-driven-approach","Model Management in Banking during the Crisis – A Corridor Platform driven approach","Risk Management Insights","What capability allows the Corridor Platform to automate continuous model monitoring?","The Corridor Platform's scheduling capability automates continuous model monitoring. It allows banks to set up monitoring at pre-scheduled periods and define performance benchmark thresholds. If a threshold is breached, an exception trigger report is sent to the model monitoring team, which automates the process and facilitates management by exception."],["113","40","https://www.corridorplatforms.com/post/digital-decisioning-challenges-for-credit-unions-and-community-banks-in-recession","Digital Decisioning Challenges for Credit Unions and Community Banks in Recession","Risk Management Insights","Why must mid-tier banks transform their decisioning capability?","To compete in today’s market, mid-tier banks and credit unions must transform their decisioning capability to meet customers’ heightened digital lending expectations."],["114","40","https://www.corridorplatforms.com/post/digital-decisioning-challenges-for-credit-unions-and-community-banks-in-recession","Digital Decisioning Challenges for Credit Unions and Community Banks in Recession","Risk Management Insights","What risk do smaller banks face if they cannot provide fast, personalized loan offers?","If smaller banks are unable to provide fast, personalized loan offers, customers who do not receive the anticipated level of service will switch to a more responsive institution. They also face the risk of adverse selection, meaning the applicants who do come to the bank might be the ones they do not want to approve."],["115","40","https://www.corridorplatforms.com/post/digital-decisioning-challenges-for-credit-unions-and-community-banks-in-recession","Digital Decisioning Challenges for Credit Unions and Community Banks in Recession","Risk Management Insights","What solution provides mid-sized banks with off-the-shelf Tier 1 digital decisioning capability?","Decision-as-a-Service (DaaS) solutions provide community banks and credit unions with off-the-shelf Tier 1 capability, characterized by speedy digital decisioning and robust analytical capabilities."],["116","41","https://www.corridorplatforms.com/","Corridor Platforms | Decision Workflow Governance & Automation","Core Product : Decision Intelligence Platform","What does the Corridor Platforms' workflow automation platform help institutions achieve?","Corridor Platforms' Decision and Analytics workflow automation platform helps institutions upgrade to advanced analytics and real-time decisioning capabilities with a bedrock of systematic governance and compliance in the most efficient manner."],["117","41","https://www.corridorplatforms.com/","Corridor Platforms | Decision Workflow Governance & Automation","Core Product : Decision Intelligence Platform","By what percentage can this platform help institutions reduce costs?","Corridor Platforms can help institutions reduce costs by 20-30%."],["118","42","https://www.corridorplatforms.com/blank-6","Sandbox Mock | Corridor Platforms","Solution and Service Offerings","What critical issues can be simulated within the sandbox's Interactive Risk Labs?","The Interactive Risk Labs allow users to simulate critical issues such as hallucinations, bias, toxicity, and privacy leakage."],["119","42","https://www.corridorplatforms.com/blank-6","Sandbox Mock | Corridor Platforms","Solution and Service Offerings","How does the sandbox help users meet audit and compliance requirements?","The Responsible AI Sandbox helps meet audit and compliance requirements by automatically generating documentation, model lineage, and approval workflows for internal and regulatory needs."],["120","43","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/web-servers/","Web Server Setup - Corridor GGX Documentation","Platform Architecture and Technology","What is the primary benefit of using Nginx as a reverse-proxy with a WSGI server?","Using the lightweight Nginx as a reverse-proxy with a WSGI server makes the Platform's server components highly performant, enabling the server to scale to a large number of users with ease."],["121","43","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/web-servers/","Web Server Setup - Corridor GGX Documentation","Platform Architecture and Technology","Which two Nginx settings should be modified to optimize for large file uploads?","To optimize for large file uploads, the two Nginx settings that need to be modified are: `proxy_request_buffering off` and `client_max_body_size 0;`. These should be added to the server directive that expects a large file size payload."],["122","43","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/web-servers/","Web Server Setup - Corridor GGX Documentation","Platform Architecture and Technology","For Apache, what file should be updated to configure a secure connection?","To set up a secure connection for Apache, the `/etc/httpd/sites-available/corridorapp.conf` file should be updated."],["123","44","https://ggx-docs.corridorplatforms.com/register-and-refine/lineage-tracking/","Lineage Tracking - Corridor GGX Documentation","Core Product : GenGuardX","What is the primary function of lineage tracking?","Lineage tracking records and visualizes the complete lifecycle of an object, depicting the flow of execution to show how objects interact, are transformed, and executed. It also captures an object's origins, the building blocks used, its transformations, and its usages across the organization."],["124","44","https://ggx-docs.corridorplatforms.com/register-and-refine/lineage-tracking/","Lineage Tracking - Corridor GGX Documentation","Core Product : GenGuardX","How does lineage tracking make impact assessments for modifications easier?","Lineage tracking makes impact assessments for modifications easier by providing a clear view of all dependent objects that would be affected by changes and by identifying the necessary updates required across dependencies."],["125","44","https://ggx-docs.corridorplatforms.com/register-and-refine/lineage-tracking/","Lineage Tracking - Corridor GGX Documentation","Core Product : GenGuardX","What are the two key elements of the lineage structure on the GGX platform?","The two key elements of the lineage structure on the GGX platform are Precedents (Inputs), which represent the sources or dependencies that contribute to the creation of an object, and Dependents (Usage), which indicate other objects that rely on a given object."],["126","45","https://www.corridorplatforms.com/post/datava-and-corridor-announce-a-strategic-partnership-to-revolutionize-data-and-decision-management","Datava and Corridor announce a Strategic Partnership to Revolutionize Data and Decision Management for Credit Unions","Corporate Profile and Strategy","What is the primary goal of the partnership between Datava and Corridor?","The partnership between Datava and Corridor is designed to reshape how credit unions and community banks use their data and decision-making capabilities. The goals are to enhance and personalize member experiences, optimize and automate processes, and help them compete with larger banks and FinTechs."],["127","45","https://www.corridorplatforms.com/post/datava-and-corridor-announce-a-strategic-partnership-to-revolutionize-data-and-decision-management","Datava and Corridor announce a Strategic Partnership to Revolutionize Data and Decision Management for Credit Unions","Corporate Profile and Strategy","Which types of financial institutions does this partnership aim to serve?","The strategic partnership between Datava and Corridor is designed to serve credit unions and community banks."],["128","45","https://www.corridorplatforms.com/post/datava-and-corridor-announce-a-strategic-partnership-to-revolutionize-data-and-decision-management","Datava and Corridor announce a Strategic Partnership to Revolutionize Data and Decision Management for Credit Unions","Corporate Profile and Strategy","What is a key benefit of unifying Datava's and Corridor's platforms?","The integration of Datava’s data activation platform with Corridor’s decision management system provides a holistic solution that simplifies data management and enhances decision-making processes."],["129","46","https://www.corridorplatforms.com/post/teachers-federal-credit-union-selects-corridor-platforms-to-help-accelerate-transformation-and-growt","Teachers Federal Credit Union Selects Corridor Platforms to Help Accelerate Transformation and Growth","Corporate Profile and Strategy","What capability is Teachers Federal Credit Union integrating through its partnership with Corridor Platforms?","Through its partnership with Corridor Platforms, Teachers Federal Credit Union is integrating state-of-the-art real-time credit decisioning capabilities to redefine its approach to decision management."],["130","46","https://www.corridorplatforms.com/post/teachers-federal-credit-union-selects-corridor-platforms-to-help-accelerate-transformation-and-growt","Teachers Federal Credit Union Selects Corridor Platforms to Help Accelerate Transformation and Growth","Corporate Profile and Strategy","How many members does Teachers Federal Credit Union have?","Teachers Federal Credit Union has more than 460,000 members across all 50 states."],["131","46","https://www.corridorplatforms.com/post/teachers-federal-credit-union-selects-corridor-platforms-to-help-accelerate-transformation-and-growt","Teachers Federal Credit Union Selects Corridor Platforms to Help Accelerate Transformation and Growth","Corporate Profile and Strategy","What will the credit union maintain control over during its collaboration with Corridor Platforms?","During its collaboration with Corridor Platforms, Teachers Federal Credit Union will maintain full control over its data and core operations."],["132","47","https://ggx-docs.corridorplatforms.com/","What is Corridor GenGuardX (\"GGX\")? - Corridor GGX Documentation","Core Product : GenGuardX","What is Corridor GenGuardX?","Corridor GenGuardX (GGX) is a Responsible AI Governance & Testing Automation Platform designed by risk management experts to help companies harness the benefits of GenAI. It enables the secure and compliant deployment of high-impact GenAI applications like IVR systems, agent assist tools, and chatbots by addressing challenges such as model risk management, hallucinations, PII leakage, and fair lending bias."],["133","47","https://ggx-docs.corridorplatforms.com/","What is Corridor GenGuardX (\"GGX\")? - Corridor GGX Documentation","Core Product : GenGuardX","What critical challenges, such as hallucinations and PII leakage, does the GGX platform address?","The GGX platform addresses critical challenges often overlooked by existing tools, including robust model risk management, hallucinations, PII leakage, and fair lending bias."],["134","47","https://ggx-docs.corridorplatforms.com/","What is Corridor GenGuardX (\"GGX\")? - Corridor GGX Documentation","Core Product : GenGuardX","What structured framework does GGX offer for managing GenAI applications?","GGX offers a structured framework for registering, refining, evaluating, approving, deploying, and monitoring GenAI applications. This includes a 'Register & Refine' phase for building applications and optimizing pipelines, an 'Evaluate & Approve' phase with standardized testing and approval tracking, and a 'Deploy & Monitor' phase for direct-to-production deployment with ongoing monitoring."],["135","48","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/comparison/","Comparisons - Corridor GGX Documentation","Core Product : GenGuardX","What is the primary function of the platform's comparison capability?","The platform's comparison capability allows users to compare registered objects for a specific task using standard and customized metrics. This enables the quick evaluation of a list of candidates to select the best one."],["136","48","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/comparison/","Comparisons - Corridor GGX Documentation","Core Product : GenGuardX","What four components are typically involved in a comparison task?","A comparison task typically involves four components: a current object, which is the object selected for comparison; challenger objects of the same type; a common data source on which the objects will be evaluated; and the report and metrics to be compared."],["137","48","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/comparison/","Comparisons - Corridor GGX Documentation","Core Product : GenGuardX","How does the platform expedite the evaluation process for comparison tasks?","The platform expedites the evaluation process by allowing jobs to run in parallel and using multiple threads at a time within a job."],["138","49","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/scalability/","Scalability and Sizing - Corridor GGX Documentation","Platform Architecture and Technology","What determines the throughput for production orchestrations?","The throughput for production orchestrations depends on the method of deployment of the Production layer, such as an HTTP API, serverless architecture, or python runtime execution."],["139","49","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/scalability/","Scalability and Sizing - Corridor GGX Documentation","Platform Architecture and Technology","What is the solution if a large job blocks the queue for later jobs?","If a large job is blocking the queue for later jobs, the issue can be handled by adding more \"Spark - Celery Workers\" as needed."],["140","49","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/scalability/","Scalability and Sizing - Corridor GGX Documentation","Platform Architecture and Technology","What are two potential application bottlenecks when concurrent users increase?","When the number of concurrent users increases, two potential application bottlenecks are the Metadata Database and the API Server."],["141","50","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/model-catalog/","Model Catalog - Corridor GGX Documentation","Core Product : GenGuardX","What are the three main components that typically constitute a model?","A model typically includes one or more of the following components:\n\n*   **Model file:** Stores learned weights/parameters, lookup tables, tensors, and other important data to be used for initializing the model.\n*   **Initialization Logic:** Prepares the model or client for processing multiple inputs if needed.\n*   **Scoring Logic:** Code that applies the initialized model to provide inputs to generate or predict responses."],["142","50","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/model-catalog/","Model Catalog - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of the Model Catalog?","The Model Catalog organizes all registered models into customized groups at a centralized location, allowing for easier tracking, monitoring, and model creation."],["143","50","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/model-catalog/","Model Catalog - Corridor GGX Documentation","Core Product : GenGuardX","What type of violation does model registration automatically detect?","Model registration automatically detects Permissible Purpose violations."],["144","51","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/document-generation/","Document Generation - Corridor GGX Documentation","Core Product : GenGuardX","What file formats are available for exporting documentation?","Corridor can export documentation into various formats, such as Word or PDF."],["145","51","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/document-generation/","Document Generation - Corridor GGX Documentation","Core Product : GenGuardX","Why does Corridor export information into formats like Word or PDF?","Corridor exports information into formats like Word or PDF to make it easy to submit documentation and audit reports external to the system."],["146","51","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/document-generation/","Document Generation - Corridor GGX Documentation","Core Product : GenGuardX","Where can a user find the automated documentation for evaluations?","Automated documentation for evaluations is available on the Job Details tab."],["147","52","https://www.corridorplatforms.com/platform","Platform | Corridor Platforms","Core Product : Decision Intelligence Platform","What core capability does the digital decisioning platform provide to institutions?","The platform enables institutions of all sizes to upgrade to advanced real-time decisioning capabilities with strong compliance and governance, using state-of-the-art Decision and Analytics workflow automation."],["148","52","https://www.corridorplatforms.com/platform","Platform | Corridor Platforms","Core Product : Decision Intelligence Platform","What is the main advantage of the platform's modular, two-layered architecture?","The platform's two-layered modular architecture seamlessly integrates data management, feature engineering, model development, and decision actions in a shared governed workspace. This modularity allows users to flexibly pick and choose decision components to build a use case and easily reuse pre-existing components."],["149","52","https://www.corridorplatforms.com/platform","Platform | Corridor Platforms","Core Product : Decision Intelligence Platform","What does the platform's 'Plug & Play' feature enable for users?","The 'Plug & Play' feature enables users to continuously innovate and upgrade with plug-and-play decision components without breaking the integrity of the underlying governed decision pipeline."],["150","53","https://www.corridorplatforms.com/chad","Connect with Chad | Corridor Platforms","Corporate Profile and Strategy","What is Chad's title at Corridor Platforms?","Chad is the VP of Sales at Corridor Platforms."],["151","54","https://ggx-docs.corridorplatforms.com/technology/self-hosting/","Self-Hosted Corridor - Corridor GGX Documentation","Platform Architecture and Technology","What is the purpose of Corridor's analytical layer?","The analytical layer of Corridor is for analysts to test and validate their logic and get the required approvals and compliance checks."],["152","54","https://ggx-docs.corridorplatforms.com/technology/self-hosting/","Self-Hosted Corridor - Corridor GGX Documentation","Platform Architecture and Technology","Why is the Corridor platform divided into various modular components?","Corridor is divided into various components to keep it modular, enable easy scaling for cloud-based deployments, and manage high loads without much change."],["153","54","https://ggx-docs.corridorplatforms.com/technology/self-hosting/","Self-Hosted Corridor - Corridor GGX Documentation","Platform Architecture and Technology","Which component is responsible for orchestrating worker tasks?","The Messaging Queue (Redis) is the component that orchestrates worker tasks."],["154","55","https://www.corridorplatforms.com/about-us","About Us | Corridor Platforms","Corporate Profile and Strategy","What capability does Corridor Platforms provide to institutions?","Corridor Platforms is a next-gen Decision Management Platform that provides institutions of all sizes with real-time decisioning capabilities and advanced analytics, which are needed to compete in the digital era. It was built to quickly provide the technical capabilities necessary to transform decisioning to best in class."],["155","55","https://www.corridorplatforms.com/about-us","About Us | Corridor Platforms","Corporate Profile and Strategy","Who is the CEO of Corridor Platforms?","Manish Gupta is the CEO of Corridor Platforms."],["156","55","https://www.corridorplatforms.com/about-us","About Us | Corridor Platforms","Corporate Profile and Strategy","What is Aditya Khandekar's primary charter as Chief Revenue Officer?","Aditya Khandekar's primary charter at Corridor is to build and scale the India delivery model for R&D and client delivery teams, a critical asset for the success of Corridor Platforms."],["157","56","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/notifications/","Email Notifications - Corridor GGX Documentation","Platform Architecture and Technology","What are some of the platform events that can trigger an email notification?","Email notifications are triggered by several platform events, including the completion or failure of a job run, a change in the workflow status of an object, review status changes or comments added during the approval process, and the sharing of an object."],["158","56","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/notifications/","Email Notifications - Corridor GGX Documentation","Platform Architecture and Technology","Can a user customize which notifications will be sent as an email?","The user cannot customize which notifications will be sent as email."],["159","56","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/notifications/","Email Notifications - Corridor GGX Documentation","Platform Architecture and Technology","Which file is used to configure the email notification settings?","Email notifications can be configured in the `api_config.py` file."],["160","57","https://www.corridorplatforms.com/post/oliver-wyman-announces-equity-investment-in-corridor-platforms","Oliver Wyman Announces Equity Investment in Corridor Platforms","Corporate Profile and Strategy","Which global management consulting firm acquired a minority stake in Corridor Platforms?","Global management consulting firm Oliver Wyman acquired a minority stake in Corridor Platforms, an industry-leading decision workflow governance and automation software provider."],["161","57","https://www.corridorplatforms.com/post/oliver-wyman-announces-equity-investment-in-corridor-platforms","Oliver Wyman Announces Equity Investment in Corridor Platforms","Corporate Profile and Strategy","What is Corridor Platforms' area of expertise as a software provider?","Corridor Platforms is an industry-leading decision workflow governance and automation software provider."],["162","57","https://www.corridorplatforms.com/post/oliver-wyman-announces-equity-investment-in-corridor-platforms","Oliver Wyman Announces Equity Investment in Corridor Platforms","Corporate Profile and Strategy","When did the strategic collaboration between Oliver Wyman and Corridor Platforms begin?","Oliver Wyman and Corridor Platforms entered into a strategic collaboration in July 2019."],["163","58","https://ggx-docs.corridorplatforms.com/integrations/","Overview - Corridor GGX Documentation","Core Product : GenGuardX","Into which three categories are Corridor GGX integrations organized?","Corridor GGX integrations are organized into three categories: LLM Providers, Agent Providers & Frameworks, and Evaluation Libraries."],["164","58","https://ggx-docs.corridorplatforms.com/integrations/","Overview - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of integrating LLM Providers into Corridor GGX?","The purpose of integrating LLM Providers into Corridor GGX is to connect to popular foundational models from leading providers to power your generative experiences."],["165","58","https://ggx-docs.corridorplatforms.com/integrations/","Overview - Corridor GGX Documentation","Core Product : GenGuardX","How are Agent Providers and Frameworks utilized within the GGX platform?","Agent Providers and Frameworks are utilized to leverage pre-built agent providers or bring your own orchestration frameworks to create and manage intelligent, multi-step agent workflows with minimal setup."],["166","59","https://www.corridorplatforms.com/how-we-help/modeling","How We Help Modeling | Corridor Platforms","Core Product : Decision Intelligence Platform","How does the platform provide transparency into compliance requirements for modelers?","Corridor Platforms creates a governed modeling pipeline with complete transparency, which provides modelers with full knowledge of compliance requirements during the build process."],["167","59","https://www.corridorplatforms.com/how-we-help/modeling","How We Help Modeling | Corridor Platforms","Core Product : Decision Intelligence Platform","What features are offered to speed up the model approval process?","To speed up the model approval process, Corridor Platforms offers a compliant feature store, automated approval workflows, and industry-standard compliance dashboards and model documentation templates."],["168","59","https://www.corridorplatforms.com/how-we-help/modeling","How We Help Modeling | Corridor Platforms","Core Product : Decision Intelligence Platform","How does the platform help users take corrective action to avoid loss from model decay?","The platform provides standardized monitoring dashboards for real-time insights and performance metrics. It also automates alerts, which enables users to take corrective actions immediately to avoid any loss in profitability due to model decay."],["169","60","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/","Deployment and Monitoring - Corridor GGX Documentation","Core Product : GenGuardX","What happens to a pipeline after it has been evaluated and approved?","After a pipeline is evaluated and approved, the locked pipeline artifact can be exported directly to production."],["170","60","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/","Deployment and Monitoring - Corridor GGX Documentation","Core Product : GenGuardX","How does the platform automate the monitoring of pipelines in production?","The platform automates production monitoring by ingesting data from relevant systems, generating performance metrics, and providing intuitive monitoring dashboards and alerting capabilities. It also offers Annotation Queues, which enable human reviewers to evaluate and label production data, with automated dashboards for key insights and statistics."],["171","60","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/","Deployment and Monitoring - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of the Annotation Queues feature?","The Annotation Queues feature enables human reviewers to evaluate and label production data, and it provides automated dashboards for key insights and statistics."],["172","61","https://www.corridorplatforms.com/offerings","Offerings | Corridor Platforms","Solution and Service Offerings","Which solution is designed for organizations with on-premise or private cloud-based infrastructure?","The Client Install solution is designed for organizations with on-premise or private cloud-based decisioning technology infrastructure. It allows for the deployment of a decision management platform on-premise or in a private cloud."],["173","61","https://www.corridorplatforms.com/offerings","Offerings | Corridor Platforms","Solution and Service Offerings","What does the RiskDecisioning.AI service provide until the client takes over?","RiskDecisioning.AI is a turnkey consulting and deployment service where Corridor deploys the decision management platform, provides a managed solution, and offers analytical consulting and training until the client takes over."],["174","61","https://www.corridorplatforms.com/offerings","Offerings | Corridor Platforms","Solution and Service Offerings","What are the three components of the Enhanced Support and Maintenance add-on?","The Enhanced Support and Maintenance add-on includes a dedicated technical account manager, in-depth training on basic and advanced capabilities specific to your needs, and shorter SLAs for support and consulting services to accelerate adoption."],["175","62","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/performance/","Performance Tracking - Corridor GGX Documentation","Core Product : GenGuardX","What conditions must a job meet to be selected for the Metrics Dashboard?","To be selected for the Metrics Dashboard, a job must meet the following conditions: it must be the Iteration0 of a recurring job, have at least two iterations left to be completed, and not be marked as 'old'. The job can be of any type, such as Simulation, Comparison, or Validation."],["176","62","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/performance/","Performance Tracking - Corridor GGX Documentation","Core Product : GenGuardX","What happens if a user takes no action after a tracked job's iterations end?","If a user takes no action after a tracked job's iterations end, the last iteration will continue to be shown in the Metrics Dashboard."],["177","62","https://ggx-docs.corridorplatforms.com/deploy-and-monitor/performance/","Performance Tracking - Corridor GGX Documentation","Core Product : GenGuardX","What types of actions can be triggered when a custom alert's conditions are met?","When a custom alert's conditions are met, the following actions can be triggered: sending a notification to selected users or user roles, adding a predefined flag to the object responsible for the alert, creating a review for approved objects, or sending an email to external users."],["178","63","https://www.corridorplatforms.com/post/left-shift-decisioning-a-key-differentiator-for-banks-to-be-nimble","Left Shift Decisioning, a Key Differentiator for Banks to Be Nimble","Risk Management Insights","What is the core concept of 'left shifting' in software development?","The core concept of left shifting is to move the testing phase to earlier stages in the software life cycle. The goal is to test early, fix bugs close to the source of the issue, and prevent the backloading of bugs."],["179","63","https://www.corridorplatforms.com/post/left-shift-decisioning-a-key-differentiator-for-banks-to-be-nimble","Left Shift Decisioning, a Key Differentiator for Banks to Be Nimble","Risk Management Insights","What are the listed benefits of successfully implementing the left shift concept?","If implemented successfully, the left shift concept results in faster iterative cycles for new features in agile development, lower cost and effort, shortened time-to-market, and better stability and quality of the end-product."],["180","63","https://www.corridorplatforms.com/post/left-shift-decisioning-a-key-differentiator-for-banks-to-be-nimble","Left Shift Decisioning, a Key Differentiator for Banks to Be Nimble","Risk Management Insights","Why is 'left shift decisioning' particularly important in the current recessionary environment?","In the current recessionary environment, banks need to react quickly to market dynamics to stay competitive. Left shift decisioning is important because it shortens the reaction time to competitor moves and customer needs, while also reducing the potential for regulatory and reputational risk. This can become a sustained differentiator, allowing banks that implement it to gain market share and win against competitors."],["181","64","https://www.corridorplatforms.com/how-we-help/technology","How We Help Technology | Corridor Platforms","Platform Architecture and Technology","What role does Corridor Platforms serve within a technology stack?","Corridor Platforms provides the glue to a technology stack, which makes it easy to switch between systems without compromising on stability and security."],["182","64","https://www.corridorplatforms.com/how-we-help/technology","How We Help Technology | Corridor Platforms","Platform Architecture and Technology","How does the platform help companies avoid lengthy development cycles?","The platform helps companies sidestep lengthy development cycles by providing a configurable platform where all needs, changes, and competitive knowledge are seamlessly integrated. This allows them to get the functionality they need without the added complexity of building from scratch."],["183","64","https://www.corridorplatforms.com/how-we-help/technology","How We Help Technology | Corridor Platforms","Platform Architecture and Technology","What allows users to replace legacy systems without disrupting the analytical pipeline?","A run-time knowledge management center and the ability to recreate any historical decision as needed allow users to replace legacy systems and technologies without disrupting the analytical pipeline."],["184","65","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/human-testing/","Human Integrated Testing - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of Pre-Approval Testing?","Pre-Approval Testing allows users to test the full end-to-end pipeline in a production-like environment, providing an opportunity to manually validate the final solution before deployment. It simulates real-world scenarios and enables reviewers to capture feedback and scores to help improve the solution."],["185","65","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/human-testing/","Human Integrated Testing - Corridor GGX Documentation","Core Product : GenGuardX","What type of pipelines are currently available for manual testing?","Currently, only the chat-based pipelines registered on the platform are available for manual testing."],["186","65","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/human-testing/","Human Integrated Testing - Corridor GGX Documentation","Core Product : GenGuardX","How does the testing module simplify the evaluation process for reviewers?","The testing module simplifies the evaluation process by abstracting internal technical details and complex pipeline logic. It presents only the final inputs and outputs for a streamlined evaluation and provides an easy-to-follow, intuitive user interface."],["187","66","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/backups/","Backups & Restore - Corridor GGX Documentation","Platform Architecture and Technology","What are the four systems used for persistent data storage that require backups?","The systems used for persistent data storage that require backups are the Metadata Database, File Management, Data Lake, and Settings."],["188","66","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/backups/","Backups & Restore - Corridor GGX Documentation","Platform Architecture and Technology","What are the two methods available for backing up the Metadata Database?","The two methods for backing up the Metadata Database are: using the standard backup manager recommended for your RDBMS (for example, `expdp` for Oracle), or using the `corridor-API db export` command to save the database into an SQLite file."],["189","66","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/backups/","Backups & Restore - Corridor GGX Documentation","Platform Architecture and Technology","Which command restores a database backup from an SQLite file?","The `corridor-api db import` command can be used to import an SQLite file back into the system where the restore is being run. This is used if the backup was created using the `corridor-api db export` method."],["190","67","https://www.corridorplatforms.com/contact-us","Contact Us | Corridor Platforms","Corporate Profile and Strategy","In which two countries are the company's offices located?","The company's offices are located in the United States and India."],["191","67","https://www.corridorplatforms.com/contact-us","Contact Us | Corridor Platforms","Corporate Profile and Strategy","What is the address of the office in New Jersey?","The address of the office in New Jersey is 826 Sunset Avenue, Haworth, New Jersey 07641."],["192","67","https://www.corridorplatforms.com/contact-us","Contact Us | Corridor Platforms","Corporate Profile and Strategy","In which city is the company's office in India located?","The company's office in India is located in Bengaluru, Karnataka."],["193","68","https://ggx-docs.corridorplatforms.com/integrations/evaluation_libraries/cleanlab/","Cleanlab - Corridor GGX Documentation","Core Product : GenGuardX","What service does Cleanlab provide for Enterprise AI applications?","Cleanlab provides software to detect and remediate inaccurate responses from Enterprise AI applications. This service acts as a trust and reliability layer to ensure that Agents, RAG, and Chatbots remain safe and helpful."],["194","68","https://ggx-docs.corridorplatforms.com/integrations/evaluation_libraries/cleanlab/","Cleanlab - Corridor GGX Documentation","Core Product : GenGuardX","What types of issues can Cleanlab identify across agents and RAG pipelines?","Cleanlab can systematically identify hallucinations, off-topic responses, unsafe outputs, and other critical issues across agents, RAG pipelines, and broader LLM workflows."],["195","68","https://ggx-docs.corridorplatforms.com/integrations/evaluation_libraries/cleanlab/","Cleanlab - Corridor GGX Documentation","Core Product : GenGuardX","How does Cleanlab enhance the evaluation of Interactive Voice Response (IVR) systems?","Cleanlab enhances the evaluation of Interactive Voice Response (IVR) systems by providing trustworthiness scores for various AI-driven processes. It evaluates the reliability of LLM decisions in classifying caller intent, routing calls, and providing responses. Cleanlab also assesses the accuracy of human data labels used in validation to pinpoint mislabeled data. For auto-generated call summaries and candidate responses, its scores can highlight problematic outputs and areas where the agent may need improvement."],["196","69","https://www.corridorplatforms.com/post/the-digital-lending-revolution-opportunities-challenges-for-community-fis","The Digital Lending Revolution : Opportunities & Challenges for Community FIs","Risk Management Insights","How does digital lending differ from the traditional lending process for consumers?","In digital lending, consumers can apply to numerous lenders online at the same time, receive instantaneous offers, and accept the most favorable one in real-time. This is in contrast to traditional lending, where consumers typically applied for loans physically at their bank using paper applications that took several days for a decision."],["197","69","https://www.corridorplatforms.com/post/the-digital-lending-revolution-opportunities-challenges-for-community-fis","The Digital Lending Revolution : Opportunities & Challenges for Community FIs","Risk Management Insights","What is considered the most significant pitfall for financial institutions when adopting digitization?","The most significant pitfall for financial institutions is tackling digitization in a fragmented fashion. Automating isolated processes to address specific issues can lead to complexities and may require a return to manual operations due to inadequate integration within the system."],["198","69","https://www.corridorplatforms.com/post/the-digital-lending-revolution-opportunities-challenges-for-community-fis","The Digital Lending Revolution : Opportunities & Challenges for Community FIs","Risk Management Insights","What are the primary factors contributing to the growth of digital lending?","The major factors driving the expansion of digital lending are: the market influence of tech-savvy Millennials and Gen Z, who are the largest drivers of new loan demand; the increased availability of data and analytical sophistication for enhanced decision-making; and the optimization of speed and cost through technology that eliminates operational inefficiencies and expedites the credit approval process."],["199","70","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/approval-workflows/","Approval Workflows - Corridor GGX Documentation","Core Product : GenGuardX","What happens to an object after it has been approved?","Once an object is approved, it is locked, and no further changes can be made to it. However, an object can be flagged even after approval if reviews identify findings or limitations that require follow-ups."],["200","70","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/approval-workflows/","Approval Workflows - Corridor GGX Documentation","Core Product : GenGuardX","Which key stakeholders are involved in the approval workflow decision-making process?","The key stakeholders involved in the approval workflow decision-making process include developers, legal, compliance, and business teams."],["201","70","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/approval-workflows/","Approval Workflows - Corridor GGX Documentation","Core Product : GenGuardX","How can findings or limitations be tracked for an object even after its approval?","Findings or limitations for an approved object can be tracked using Corridor's flagging capability. This feature allows an object to be flagged even after approval by anyone with Write access to Settings. Once a flag is activated, a warning appears beside the object's name on its details page, indicating that it should be carefully reviewed before use."],["202","71","https://www.corridorplatforms.com/aditya","Connect with Aditya | Corridor Platforms","Corporate Profile and Strategy","Who is the Chief Revenue Officer at Corridor Platforms?","Aditya is the Chief Revenue Officer at Corridor Platforms."],["203","71","https://www.corridorplatforms.com/aditya","Connect with Aditya | Corridor Platforms","Corporate Profile and Strategy","What is Aditya's role at Corridor Platforms?","Aditya is the Chief Revenue Officer at Corridor Platforms."],["204","72","https://www.corridorplatforms.com/post/corridor-platforms-announced-finalist-for-banking-tech-awards-usa-2025","Corridor Platforms Announced Finalist for Banking Tech Awards USA 2025","Corporate Profile and Strategy","When will the winners of the Banking Tech Awards USA be announced?","The winners of the Banking Tech Awards USA 2025 will be announced at a gala dinner ceremony in New York on 29 May 2025."],["205","72","https://www.corridorplatforms.com/post/corridor-platforms-announced-finalist-for-banking-tech-awards-usa-2025","Corridor Platforms Announced Finalist for Banking Tech Awards USA 2025","Corporate Profile and Strategy","Where will the 2025 awards ceremony be held?","The 2025 awards ceremony will be held at a gala dinner at 583 Park Avenue in New York on May 29, 2025."],["206","72","https://www.corridorplatforms.com/post/corridor-platforms-announced-finalist-for-banking-tech-awards-usa-2025","Corridor Platforms Announced Finalist for Banking Tech Awards USA 2025","Corporate Profile and Strategy","What do the Banking Tech Awards USA recognize?","The Banking Tech Awards USA recognize the outstanding achievements in the banking and fintech industry across the United States."],["207","73","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/process-management/","Process Management - Corridor GGX Documentation","Platform Architecture and Technology","What are the benefits of using a process management tool?","Using a process management tool can simplify restarts, reboots, status-checks, logging, and configurations. It is recommended for ease of maintenance and monitoring and to ensure the component daemons are running correctly."],["208","73","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/process-management/","Process Management - Corridor GGX Documentation","Platform Architecture and Technology","What does Corridor offer as an alternative to tools requiring sudo access?","For situations where tools requiring `sudo` access are not an option, Corridor provides its own process manager for each component. This manager uses daemonisation to handle long-running, background processes."],["209","73","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/process-management/","Process Management - Corridor GGX Documentation","Platform Architecture and Technology","Which tool offers application-level process management independent of the host setup?","Supervisor provides application-level process management that is independent of the host setup."],["210","74","https://www.corridorplatforms.com/blank-8","AI Sandboxv1 | Corridor Platforms","Solution and Service Offerings","Who is eligible to access the Responsible AI Sandbox program?","Access to the Responsible AI Sandbox is available to a select group of US Financial Institutions."],["211","74","https://www.corridorplatforms.com/blank-8","AI Sandboxv1 | Corridor Platforms","Solution and Service Offerings","What is the specific focus of the GenAI use case provided in the sandbox?","The focus of the GenAI use case provided in the sandbox is Conversational IVR."],["212","74","https://www.corridorplatforms.com/blank-8","AI Sandboxv1 | Corridor Platforms","Solution and Service Offerings","What is the expected outcome for participants of the program?","The expected outcome for participants is a validated GenAI use case, risk controls, and a deployment roadmap."],["213","75","https://www.corridorplatforms.com/post/breaking-down-barriers-to-deploy-genai-solutions-faster-financial-brand","Breaking Down Barriers to Deploy GenAI Solutions Faster - Financial Brand","Risk Management Insights","In which areas have banks successfully implemented GenAI?","Banks have successfully implemented GenAI for internal processes and back-office operations."],["214","75","https://www.corridorplatforms.com/post/breaking-down-barriers-to-deploy-genai-solutions-faster-financial-brand","Breaking Down Barriers to Deploy GenAI Solutions Faster - Financial Brand","Risk Management Insights","What challenges hinder banks from deploying customer-facing GenAI solutions?","Banks struggle to deploy customer-facing GenAI solutions like agent assist and Conversational IVR due to regulatory compliance requirements, data privacy concerns, and model explainability needs."],["215","75","https://www.corridorplatforms.com/post/breaking-down-barriers-to-deploy-genai-solutions-faster-financial-brand","Breaking Down Barriers to Deploy GenAI Solutions Faster - Financial Brand","Risk Management Insights","What is the purpose of the GenGuardX (GGX) platform?","Corridor’s GenGuardX (GGX) platform is a comprehensive solution designed by industry experts to bridge the gap between innovation and risk management as banks’ Model Risk Management and Compliance teams deal with new GenAI risks that lack regulatory precedents."],["216","76","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/simulation/","Simulation - Corridor GGX Documentation","Core Product : GenGuardX","What is a simulation primarily used for?","A simulation is used to execute analytics contained in the definition of an object that has been registered in the platform, and to run dashboards and reports on that output."],["217","76","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/simulation/","Simulation - Corridor GGX Documentation","Core Product : GenGuardX","What are the three typical components involved in a simulation task?","A simulation task typically involves three components: a Current object (the object being tested, such as a Pipeline, Model, RAG, or Prompt), a Data Source (the data to run the object on), and Report & Metrices (the evaluation metrics to be run on the output)."],["218","76","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/simulation/","Simulation - Corridor GGX Documentation","Core Product : GenGuardX","What types of objects can be tested using a simulation?","The types of objects that can be tested using a simulation are a Pipeline, Model, RAG, or Prompt."],["219","77","https://ggx-docs.corridorplatforms.com/register-and-refine/","GenerativeAI Lifecycle Management - Corridor GGX Documentation","Core Product : GenGuardX","What is the first step in the Generative AI development lifecycle?","The first step in the Generative AI development lifecycle is Business Use Case Identification, which involves defining the problem statement and the objectives that the solution aims to address."],["220","77","https://ggx-docs.corridorplatforms.com/register-and-refine/","GenerativeAI Lifecycle Management - Corridor GGX Documentation","Core Product : GenGuardX","What is achieved by using Retrieval-Augmented Generation (RAG) in GenAI pipelines?","In GenAI pipelines, Retrieval-Augmented Generation (RAG) techniques are used to enhance model responses with external knowledge sources, which improves contextual accuracy. A robust RAG architecture ensures the pipeline retrieves the most relevant information, significantly impacting overall accuracy."],["221","77","https://ggx-docs.corridorplatforms.com/register-and-refine/","GenerativeAI Lifecycle Management - Corridor GGX Documentation","Core Product : GenGuardX","What is crucial for maintaining a pipeline's performance after it is in production?","Continuous monitoring is crucial to maintaining performance and mitigating issues such as response drift and biases."],["222","78","https://ggx.corridorplatforms.com/cloud/gcp","GenGuardX + Google Cloud - GenAI Governance","Core Product : GenGuardX","What does the Corridor GGX platform help enterprises accomplish?","Corridor GGX on Google Cloud empowers enterprises to streamline AI governance, integrate real-time data processing, and manage model compliance from a unified platform."],["223","78","https://ggx.corridorplatforms.com/cloud/gcp","GenGuardX + Google Cloud - GenAI Governance","Core Product : GenGuardX","Which Google Cloud AI services does the platform leverage for its solutions?","The platform leverages Vertex AI, Gemini, and prebuilt models from Model Garden for its comprehensive AI solutions."],["224","78","https://ggx.corridorplatforms.com/cloud/gcp","GenGuardX + Google Cloud - GenAI Governance","Core Product : GenGuardX","How is data on the platform secured both in transit and at rest?","All data in transit and at rest is encrypted with Google Cloud’s robust encryption protocols, ensuring sensitive information remains protected across the platform."],["225","79","https://ggx-docs.corridorplatforms.com/register-and-refine/collaboration/","Collaboration - Corridor GGX Documentation","Core Product : GenGuardX","What actions are permitted with 'Write' access to an object?","With 'Write' access, a user can Edit, Delete, Send for Approval, and Share with others."],["226","79","https://ggx-docs.corridorplatforms.com/register-and-refine/collaboration/","Collaboration - Corridor GGX Documentation","Core Product : GenGuardX","What are the four types of access that can be granted through the Roles capability?","The four types of access that can be granted through the Roles capability are read, write, approve, and superuser."],["227","79","https://ggx-docs.corridorplatforms.com/register-and-refine/collaboration/","Collaboration - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of creating multiple workspaces on the platform?","The creation of multiple workspaces on the platform allows teams to work independently without having visibility into each other's work."],["228","80","https://ggx-docs.corridorplatforms.com/register-and-refine/prompt-optimization/","Prompt Optimization - Corridor GGX Documentation","Core Product : GenGuardX","What is the primary goal of prompt optimization?","The primary goal of prompt optimization is to refine prompts to get better and more accurate responses from AI models by making the user's intent as clear as possible."],["229","80","https://ggx-docs.corridorplatforms.com/register-and-refine/prompt-optimization/","Prompt Optimization - Corridor GGX Documentation","Core Product : GenGuardX","What optimization method does the GGX Platform use to automate prompt refinement?","The GGX Platform simplifies and automates the prompt refinement process by introducing Hill Climbing Experimentations."],["230","80","https://ggx-docs.corridorplatforms.com/register-and-refine/prompt-optimization/","Prompt Optimization - Corridor GGX Documentation","Core Product : GenGuardX","In the Hill Climbing process, what happens when a modified prompt improves results?","If a new, modified prompt improves results, it becomes the new baseline for further iterations."],["231","81","https://www.corridorplatforms.com/post/bits-banks-with-aditya-khandekar-and-mike-kelly-episode-3","Bits & Banks - With Aditya Khandekar and Mike Kelly - Episode 3","Risk Management Insights","According to Mike Kelly, when does delinquency become a syndrome rather than a symptom?","According to Mike Kelly, delinquencies become a syndrome when they are an obsession. He argues that obsessing over these downstream symptoms distracts leadership from implementing upstream fixes."],["232","81","https://www.corridorplatforms.com/post/bits-banks-with-aditya-khandekar-and-mike-kelly-episode-3","Bits & Banks - With Aditya Khandekar and Mike Kelly - Episode 3","Risk Management Insights","What is the concept of 'onlyliness' that Mike Kelly introduces for credit unions?","The concept of 'onlyliness' is the unique value a credit union can provide that competitors cannot replicate."],["233","81","https://www.corridorplatforms.com/post/bits-banks-with-aditya-khandekar-and-mike-kelly-episode-3","Bits & Banks - With Aditya Khandekar and Mike Kelly - Episode 3","Risk Management Insights","What does Mike Kelly advocate for instead of completely shutting off lending during uncertain times?","Mike Kelly advocates for 'scalpel-level decisioning,' which involves adjusting credit strategies with surgical precision instead of completely shutting off lending. He advises that credit unions should aim to be elite lenders rather than overly cautious observers."],["234","82","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/prompts/","Prompt Registry - Corridor GGX Documentation","Core Product : GenGuardX","What are the typical components of a prompt?","A prompt typically includes a Prompt Template, which is an instruction containing placeholders, and Input Arguments, which are dynamic inputs that replace the placeholders. Additionally, Creation Logic is needed to generate the prompt by filling the input arguments into the template."],["235","82","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/prompts/","Prompt Registry - Corridor GGX Documentation","Core Product : GenGuardX","What is the function of the Prompt Registry?","The Prompt Registry organizes all registered prompts into customized groups at a centralized location, allowing for easier tracking, monitoring, and creation of new prompts."],["236","82","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/prompts/","Prompt Registry - Corridor GGX Documentation","Core Product : GenGuardX","How does prompt registration improve the journey to production?","Prompt registration improves the journey to production by making it more transparent and fully auditable. It also makes production monitoring easier and allows for the extraction of ready-to-productionize executable artifacts."],["237","83","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/saml/","SAML - Corridor GGX Documentation","Platform Architecture and Technology","What are the benefits of using SAML for authentication?","Using SAML for authentication makes it easy to ensure that the platform is available only to authorized users. It also makes having a centralized Identity Provider hassle-free and ensures that standard security practices like Single Sign-On and 2-factor Authentication are consistently applied to all of an organization's applications."],["238","83","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/saml/","SAML - Corridor GGX Documentation","Platform Architecture and Technology","What information is required from the Identity Provider to configure SAML-based login?","To configure SAML-based login, the following information is required from the Identity Provider (IDP):\n\n*   **SSO URL:** The URL endpoint to initiate Single Sign On requests.\n*   **Entity ID:** The URL endpoint to fetch the SAML metadata.\n*   **Name ID:** A unique ID to identify each user.\n*   **Certificate:** The X509 certificate used to ensure that any messages sent or received are trusted."],["239","83","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/saml/","SAML - Corridor GGX Documentation","Platform Architecture and Technology","What user attributes must be returned to Corridor after the sign-on flow is complete?","Upon completing the sign-on flow, the information returned to Corridor must contain the Name ID and the following attributes: Email and a list of the user's Roles/Groups. The names for the Email and Role attributes can be configured with `SAML_EMAIL_ATTRIBUTE` and `SAML_ROLE_ATTRIBUTE` respectively."],["240","84","https://www.corridorplatforms.com/post/credit-line-increase-a-proactive-customer-management-approach-on-corridor-platform","Credit Line Increase – A Proactive Customer Management Approach on Corridor Platform","Risk Management Insights","What business problem do banks face in a post-pandemic recovery environment?","In a post-pandemic recovery environment where consumer spending is increasing, banks must be highly proactive in managing customer expectations. They face fierce competition from agile online specialty lenders, fintechs, and Neobanks who are aggressively trying to poach customers."],["241","84","https://www.corridorplatforms.com/post/credit-line-increase-a-proactive-customer-management-approach-on-corridor-platform","Credit Line Increase – A Proactive Customer Management Approach on Corridor Platform","Risk Management Insights","What can serve as a key retention tool for banks competing with online lenders?","Proactive customer line management strategies can be a key retention tool and competitive differentiator for banks, especially if they are able to execute their CLI strategies, refinements, and deployment processes well."],["242","84","https://www.corridorplatforms.com/post/credit-line-increase-a-proactive-customer-management-approach-on-corridor-platform","Credit Line Increase – A Proactive Customer Management Approach on Corridor Platform","Risk Management Insights","What is Corridor Platforms designed to do for risk and marketing decisioning at banks?","Corridor Platforms is a decision workflow governance and automation capability designed to rapidly transform risk and marketing decisioning at banks. It enables them to leverage new data, AI, and automation to create competitive excellence in revenue growth, risk control, and operating efficiency."],["243","85","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/","Evaluations and Approval - Corridor GGX Documentation","Core Product : GenGuardX","Why is evaluating GenAI pipelines considered essential for development?","Evaluating GenAI pipelines is essential to ensure they generate reliable, high-quality responses. It helps determine if changes to the pipeline are improving performance or causing issues. By measuring factors like relevance, hallucination rates, and latency, teams can make informed decisions to optimize their pipelines, maintain consistent performance, and catch issues early. This process helps build trust and keeps LLM applications accurate, scalable, and dependable."],["244","85","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/","Evaluations and Approval - Corridor GGX Documentation","Core Product : GenGuardX","What are the two primary methods used for assessing LLM performance?","The two primary methods for assessing LLM performance are automated evaluation, which uses LLMs or code, and human annotations, where experts manually review and label LLM outputs."],["245","85","https://ggx-docs.corridorplatforms.com/evaluate-and-approve/","Evaluations and Approval - Corridor GGX Documentation","Core Product : GenGuardX","What happens to an object after it receives final approval in the workflow?","Once an object is approved, it is locked to prevent any modifications within the system. This ensures the artifact remains unchanged before it is exported to the production system."],["246","86","https://www.corridorplatforms.com/job-board/marketing-coordinator","GenAI Data Scientist","Corporate Profile and Strategy","What is the required educational background for the GenAI Data Scientist position?","The required educational background for the GenAI Data Scientist position is a Master's in Computer Science, Data Science, or a related field."],["247","86","https://www.corridorplatforms.com/job-board/marketing-coordinator","GenAI Data Scientist","Corporate Profile and Strategy","What is the minimum required experience in developing and deploying AI/ML solutions?","The minimum required experience is 2+ years in developing and deploying AI/ML solutions, with a focus on NLP and generative AI."],["248","86","https://www.corridorplatforms.com/job-board/marketing-coordinator","GenAI Data Scientist","Corporate Profile and Strategy","What potential risks in LLM pipelines should a candidate be able to mitigate?","A candidate should be able to identify and mitigate potential risks in LLM pipelines, including data privacy and security concerns, bias and fairness issues in model outputs, hallucination and factual accuracy problems, prompt injection vulnerabilities, and model drift and performance degradation over time."],["249","87","https://www.corridorplatforms.com/post/corridor-platforms-partners-with-digital-matrix-systems-to-transform-data-driven-decisioning-for-ban","Corridor Platforms Partners with Digital Matrix Systems to Transform Data-Driven Decisioning for Banks and Credit Unions","Corporate Profile and Strategy","How does the partnership between Corridor Platforms and DMS benefit financial institutions?","The partnership allows financial institutions to integrate DMS’s data infrastructure with Corridor Platforms’ advanced decisioning tools, enabling faster, smarter decisions throughout the customer lifecycle. Key benefits include enhanced customer experiences through real-time offerings, more robust risk management strategies, and improved regulatory compliance by combining governance-driven workflows with a strong data infrastructure."],["250","87","https://www.corridorplatforms.com/post/corridor-platforms-partners-with-digital-matrix-systems-to-transform-data-driven-decisioning-for-ban","Corridor Platforms Partners with Digital Matrix Systems to Transform Data-Driven Decisioning for Banks and Credit Unions","Corporate Profile and Strategy","What specific capability does Digital Matrix Systems provide in this collaboration?","Digital Matrix Systems (DMS) provides financial institutions with secure, seamless access to comprehensive data from credit bureaus and alternative data providers. This capability supports critical business functions such as loan origination, fraud mitigation, and risk management."],["251","87","https://www.corridorplatforms.com/post/corridor-platforms-partners-with-digital-matrix-systems-to-transform-data-driven-decisioning-for-ban","Corridor Platforms Partners with Digital Matrix Systems to Transform Data-Driven Decisioning for Banks and Credit Unions","Corporate Profile and Strategy","What does Corridor Platforms add to the data foundation provided by DMS?","Corridor Platforms builds on the data foundation provided by DMS by adding a powerful layer of end-to-end sophisticated decisioning capabilities and automated workflows to build, evaluate, govern, approve, and deploy real-time decisions."],["252","88","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/table-registry/","Data Assets - Corridor GGX Documentation","Core Product : GenGuardX","What is the primary function of the Table Registry?","The Table Registry records the location, content, and structure of source data tables used for analytics. It organizes all registered tables into customized groups at a centralized location, which allows for easier tracking, monitoring, and creation of new tables."],["253","88","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/table-registry/","Data Assets - Corridor GGX Documentation","Core Product : GenGuardX","What are the two methods available for registering a data table?","A data table can be registered using one of two methods: by connecting to a Data Lake with a direct link to a valid PySpark data file, or by uploading datasets with fewer rows directly in CSV or Excel format."],["254","88","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/table-registry/","Data Assets - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of performing a Quality Check on registered data?","A Quality Check is performed to analyze data and create standard or custom reports to assess its quality. This process supports the generation of profiling metrics, descriptive statistics, invalid entry detection, and outlier analysis to evaluate data quality effectively before it is used for downstream tasks like running jobs."],["255","89","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/concurrency/","Multiple Corridor Workers - Corridor GGX Documentation","Platform Architecture and Technology","What is required to run multiple Corridor workers on the same server?","To run multiple workers on the same server, the user must provide a name for each worker and set up worker-specific configurations in the `api_config.py` file, with each configuration being tied to the worker's name."],["256","89","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/concurrency/","Multiple Corridor Workers - Corridor GGX Documentation","Platform Architecture and Technology","What are the formatting requirements for a Corridor worker's name?","A Corridor worker's name must be in all capital letters, and underscores can be part of the name."],["257","89","https://ggx-docs.corridorplatforms.com/technology/self-hosting/scaling/concurrency/","Multiple Corridor Workers - Corridor GGX Documentation","Platform Architecture and Technology","How are worker-specific settings distinguished within the configuration file?","Worker-specific configurations in the `api_config.py` file must be prefixed with the worker name provided in the `corridor-worker run` command. This is done to avoid synchronization issues with other workers on the same server."],["258","90","https://www.corridorplatforms.com/job-board/sales-associate","Sales Associate","Corporate Profile and Strategy","Where is the Sales opening position located?","The position is located in Bangalore, IN."],["259","90","https://www.corridorplatforms.com/job-board/sales-associate","Sales Associate","Corporate Profile and Strategy","What are the main responsibilities described for a Software Engineer?","A Software Engineer is responsible for designing, developing, and maintaining software applications that deliver value to customers. They are also expected to write clean, efficient, and scalable code and collaborate with cross-functional teams to build robust software solutions."],["260","91","https://www.corridorplatforms.com/post/former-citi-ceo-ex-amex-chief-risk-officer-behind-new-risk-software","Former Citi CEO, ex-Amex chief risk officer behind new risk software","Risk Management Insights","Which three companies are jointly offering risk decisioning software and services?","EXL, a data analytics and digital operations and solutions company; Corridor Platforms, a decision workflow automation software provider; and Oliver Wyman, a management consultancy, are jointly offering risk decisioning software and services for financial institutions."],["261","91","https://www.corridorplatforms.com/post/former-citi-ceo-ex-amex-chief-risk-officer-behind-new-risk-software","Former Citi CEO, ex-Amex chief risk officer behind new risk software","Risk Management Insights","What is the joint offering from EXL, Corridor Platforms, and Oliver Wyman?","EXL, Corridor Platforms, and Oliver Wyman are jointly offering risk decisioning software and services for financial institutions."],["262","91","https://www.corridorplatforms.com/post/former-citi-ceo-ex-amex-chief-risk-officer-behind-new-risk-software","Former Citi CEO, ex-Amex chief risk officer behind new risk software","Risk Management Insights","For which type of institutions is the joint software and services offering intended?","The joint offering of risk decisioning software and services is intended for financial institutions."],["263","92","https://www.corridorplatforms.com/legal-privacy-policy","Privacy Policy | Corridor Platforms","Corporate Profile and Strategy","What types of personal data does the company collect when a user visits its website?","When a user visits the website, the company uses cookies to collect internet and network activity data, including the user's IP address, internet domain, browser type, operating system, domain name of their internet service provider, pages visited, and the length of time spent on the site. The company also collects contact information such as name, phone number, address, and email address if a user submits it through the 'Contact Us' page."],["264","92","https://www.corridorplatforms.com/legal-privacy-policy","Privacy Policy | Corridor Platforms","Corporate Profile and Strategy","With which types of third parties might the company share personal data?","The company may share personal data with its affiliates (parent business, subsidiaries, joint ventures, and affiliated companies), legal authorities in response to a lawful request, and as part of a change in corporate structure, such as a merger, acquisition, reorganization, or sale of assets."],["265","92","https://www.corridorplatforms.com/legal-privacy-policy","Privacy Policy | Corridor Platforms","Corporate Profile and Strategy","What is the company's policy regarding 'Do Not Track' browser signals?","The company does not recognize Do Not Track (DNT) signals because the World Wide Web Consortium (W3C) has not yet established universal standards for them."],["266","93","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/","Inventory Management - Corridor GGX Documentation","Core Product : GenGuardX","What types of GenAI assets can be registered and monitored on the platform?","The platform allows for the registration, tracking, and monitoring of Data and GenAI assets such as RAGs, Models, LLMs, and Pipelines at a centralized location."],["267","93","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/","Inventory Management - Corridor GGX Documentation","Core Product : GenGuardX","What are the primary benefits of using the platform's inventory management?","The primary benefits of the platform's inventory management are:\n\n- **Governance and Compliance:** It helps track AI models, datasets, and dependencies for regulatory audits.\n- **Reusability & Efficiency:** It prevents duplication of efforts and reduces onboarding time for new teams by allowing the reuse of registered and approved assets.\n- **Security & Access Control:** Centralized inventories enable proper role-based access management.\n- **Monitoring & Continuous Improvement:** It ensures GenAI systems can be tested before moving to production and monitored periodically afterward."],["268","93","https://ggx-docs.corridorplatforms.com/register-and-refine/inventory-management/","Inventory Management - Corridor GGX Documentation","Core Product : GenGuardX","What is the purpose of the Permissible Purpose Tracking feature?","Permissible Purpose Tracking enables automatic validation to ensure components are used only for authorized purposes. It also serves as a governance tracking mechanism to ensure items are used correctly."],["269","94","https://www.corridorplatforms.com/job-board/automation-engineer","Automation Engineer","Core Product : GenGuardX","What level of experience is required for the Automation Engineer position?","The Automation Engineer position requires 0-2 years of experience in quality assurance with a focus on test automation."],["270","94","https://www.corridorplatforms.com/job-board/automation-engineer","Automation Engineer","Core Product : GenGuardX","Which programming language and automation tool are required for this role?","The role requires proficiency in Python for scripting and test automation and hands-on experience with the Playwright automation tool for automating web applications."],["271","94","https://www.corridorplatforms.com/job-board/automation-engineer","Automation Engineer","Core Product : GenGuardX","What bug tracking system is mentioned for logging and tracking defects?","The role requires reporting issues through the bug tracking system, Notion. Additionally, candidates should have familiarity with bug tracking tools like JIRA, Notion, or similar."],["272","95","https://www.corridorplatforms.com/post/corridor-platforms-and-oliver-wyman-join-forces-to-address-governance-challenges-in-new-gen-ai-initi","Corridor Platforms and Oliver Wyman Join Forces to Address Governance Challenges in New Gen AI Initiative for Financial Services: Project GGX","Solution and Service Offerings","What two companies announced the new generative AI initiative called Project GGX?","Corridor Platforms, a decision workflow automation platform, and Oliver Wyman, a global management consultancy, announced a new generative AI initiative called Project GGX."],["273","95","https://www.corridorplatforms.com/post/corridor-platforms-and-oliver-wyman-join-forces-to-address-governance-challenges-in-new-gen-ai-initi","Corridor Platforms and Oliver Wyman Join Forces to Address Governance Challenges in New Gen AI Initiative for Financial Services: Project GGX","Solution and Service Offerings","What is the primary purpose of Project GGX?","The purpose of Project GGX is to chart a practical test-and-learn approach for GenAI usage that addresses the challenge of turning GenAI pilots into scaled, enterprise-safe deployments."],["274","95","https://www.corridorplatforms.com/post/corridor-platforms-and-oliver-wyman-join-forces-to-address-governance-challenges-in-new-gen-ai-initi","Corridor Platforms and Oliver Wyman Join Forces to Address Governance Challenges in New Gen AI Initiative for Financial Services: Project GGX","Solution and Service Offerings","What key challenge has prevented most companies from adopting generative AI at scale?","Most companies have not yet adopted generative AI at scale largely due to the novel risks it presents and the many unknowns that remain."],["275","96","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/common-configs/","Common Configs - Corridor GGX Documentation","Platform Architecture and Technology","Which configuration file is used for the Web Application Server?","The configuration file for the Web Application Server is `app_config.py`."],["276","96","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/common-configs/","Common Configs - Corridor GGX Documentation","Platform Architecture and Technology","What prefix must be added to a configuration key when using an environment variable?","When configuring the API/APP component via environment variables, the configuration key must be prepended with `CORRIDOR_`."],["277","96","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/common-configs/","Common Configs - Corridor GGX Documentation","Platform Architecture and Technology","What is the purpose of the `SQLALCHEMY_DATABASE_URI` API configuration?","The `SQLALCHEMY_DATABASE_URI` is the Database URI used to connect to the Metadata Database."],["278","97","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/packages/","Additional Libraries - Corridor GGX Documentation","Platform Architecture and Technology","What does Corridor allow users to do with libraries that are not included by default?","Corridor provides an option for users to use additional libraries that are not available out of the box."],["279","97","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/packages/","Additional Libraries - Corridor GGX Documentation","Platform Architecture and Technology","How many configuration steps are required to use additional libraries on the platform?","There are 5 configuration steps that must be followed to use additional libraries on the platform."],["280","97","https://ggx-docs.corridorplatforms.com/technology/self-hosting/configurations/packages/","Additional Libraries - Corridor GGX Documentation","Platform Architecture and Technology","Where in the platform UI must a new library be added to be allowed?","To be allowed, a new library must be added to the 'Allowed Python Imports' in the `Platform Settings` tab within the platform UI."],["281","98","https://www.corridorplatforms.com/riskdecisioningai","RiskDecisioning.AI | Corridor Platforms","Solution and Service Offerings","What is the primary purpose of the Riskdecisioning.AI platform?","Riskdecisioning.AI by Corridor Platforms is an end-to-end digital first decisioning platform designed to empower financial institutions with cutting-edge AI and big data technologies on a highly automated and governed analytical platform."],["282","98","https://www.corridorplatforms.com/riskdecisioningai","RiskDecisioning.AI | Corridor Platforms","Solution and Service Offerings","What benefit does the platform's 'whitebox' approach offer to institutions?","The platform's 'whitebox' approach provides full traceability of decisions and allows institutions to own their models and strategies with the flexibility to iterate them."],["283","98","https://www.corridorplatforms.com/riskdecisioningai","RiskDecisioning.AI | Corridor Platforms","Solution and Service Offerings","How does the platform help credit unions avoid depending on external providers?","With Corridor’s full-stack decisioning platform, credit unions can own their core decisioning capability and not depend on external providers. The platform's standardized, streamlined, and automated decision workflows ensure that credit unions can quickly move decisions to production."],["284","99","https://ggx.corridorplatforms.com/prompt-playground","Prompt Playground - Corridor GenGuardX","Core Product : GenGuardX","What score does the tool provide to assess prompts against Responsible AI Standards?","The tool provides a Trust Score to help you assess your system prompt and meet Responsible AI Standards."],["285","99","https://ggx.corridorplatforms.com/prompt-playground","Prompt Playground - Corridor GenGuardX","Core Product : GenGuardX","What is the stated purpose of this experimental tool for GenAI?","The stated purpose of this experimental tool is to help users get started on their GenAI journey in a responsible way by assessing their system prompt to get a Trust Score and meet Responsible AI Standards."],["286","99","https://ggx.corridorplatforms.com/prompt-playground","Prompt Playground - Corridor GenGuardX","Core Product : GenGuardX","What four components are involved in the prompt analysis process?","The four components involved in the prompt analysis process are Prompt Analysis, RAG, LLM Response, and Guardrail."],["287","100","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/minimum-requirements/","Minimum Requirements - Corridor GGX Documentation","Platform Architecture and Technology","What are the main components involved in a Corridor Installation?","The main components involved in a Corridor Installation are: Web Application & Worker, Spark Worker, Jupyter Notebook, File Management, Metadata Database (SQL RDBMS), and Redis - Messaging Queue."],["288","100","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/minimum-requirements/","Minimum Requirements - Corridor GGX Documentation","Platform Architecture and Technology","What are the minimum RAM and CPU requirements for the Spark Worker?","The minimum requirements for the Spark Worker are 16 GB of RAM and 8 CPU."],["289","100","https://ggx-docs.corridorplatforms.com/technology/self-hosting/installation/minimum-requirements/","Minimum Requirements - Corridor GGX Documentation","Platform Architecture and Technology","Which SQL databases are supported for the Metadata Database?","The supported SQL databases for the Metadata Database are Oracle 19+, MSSQL 2016+, and Postgres 11.7+."]]}